Repository: jcvignoli/lumiere-movies
Catalog: language/imdb-*.po
Languages: bg_bg

source: Options saved.
bg_bg: Настройките запазени.

source: Options reset.
bg_bg: Настройките нулирани.

source: Plugin collision. Please follow
bg_bg: Проблем с IMDB link transformer. Моля следвай

source: this link.
bg_bg: този линк(връзка).

source: Error. You have to select a value.
bg_bg: Грешка!Трябва да изберете стойност.

source: All cache deleted.
bg_bg: Целият кеш (всички запазени файлове) беше изтрит

source: Part cache deleted.
bg_bg: Избратана част от кеш беше изтрита.

source: General Options
bg_bg: Основни опции

source: Widget/Inside post Options
bg_bg: Widget/В пост опции

source: Widget unactivated
bg_bg: Widget не е активиран

source: Direct search
bg_bg: Директно търсене

source: unactivated
bg_bg: деактивиран

source: Cache management
bg_bg: Настройки за запазване на файлове

source: How to use IMDb link transformer, check FAQs & changelog
bg_bg: Как да изплзвам IMDb link transformer. Провери помощ ( FAQs) и история.

source: IMDb link transformer help
bg_bg: Помощ за IMDb link transformer

source: Help page
bg_bg: Помош

source: Help
bg_bg: Помощ

source: Results related to this film
bg_bg: Резултати за филма

source: Titles matching
bg_bg: Съответстващи заглавия

source: Director
bg_bg: Режисьор

source: more on
bg_bg: повече

source: link to imdb for
bg_bg: връзка (линк) към imdb за

source: Advanced
bg_bg: Разширени опции

source: Options below don't need usually any complementary setup. However, you can widely customize IMDb link transformer according your needs.
bg_bg: Обикновено тези опции не се нуждаят од допълнителна настройка. Вепреки това можете да подобрите изледът на IMDb link transformer както желаете

source: Paths: url & folders
bg_bg: Пътища(url) и Папки(folders)

source: Blog adress
bg_bg: Адрес на Wordpress

source: Where the blog is installed.
bg_bg: Къде е инсталиран Wordpress.

source: Default:
bg_bg: По подразбиране:

source: Plugin directory
bg_bg: Директория с разширения(плъгини)

source: Where <strong>imdb link transformer</strong> is installed.
bg_bg: Къде е инсталиран <strong>imdb link transformer</strong>.

source: Layout
bg_bg: Оформление

source: Popup
bg_bg: Изкачащ проозрец(Popup)

source: Width
bg_bg: Широчина

source: Height
bg_bg: Височина

source: Display highslide popup
bg_bg: Показвай изкачащ прозорец(highslide popup)'

source: Yes
bg_bg: Да

source: No
bg_bg: Не

source: Popup width, in pixels
bg_bg: Големина(широчина) на прозореца в пиксели

source: Popup height, in pixels
bg_bg: Големина(височина) на прозореца в пиксели

source: Imdb link picture
bg_bg: Лого за IMDb

source: Display imdb pic?
bg_bg: Показвай IMDb лого

source: Size
bg_bg: Големина

source: Whether display imdb link (the yellow icon) or not. This picture can be found into the popup when looking for akas movies. If the option is unselected, visitors will no more have opportunity to follow links to IMDb (even if they could still follow internal links).
bg_bg: Дали да показва връзка ( линк ) към imdb - жълта икона или не.Това лого може да се види в изкачащ прозорец когато търсите ака филм.Ако махнете тази опция посетителите нйама да имат възможност за отварят директен линк ( връзка) към ИМДБ (все още ве имат възможност да следват вътрешните връзки(линкове)).

source: Size of the imdb picture. The value will correspond to the width in pixels.
bg_bg: Големина на постера - щирина на постера в пиксели.

source: Url for the imdb picture
bg_bg: URL за постер

source: Imdb cover picture
bg_bg: IMDb - постер от обложка

source: Display only thumbnail
bg_bg: Показвай малки постери

source: Whether to display a thumbnail or a large image cover for movies inside a post or a widget. Select "No" to choose cover picture width (a new option on the right will be available).
bg_bg: Дали да показва малкък постер или голям постер за силми в пост или widget Избери "Не" за да избереш широчина за постерът (нова опция ще бъде достъпна за широчината).

source: Size of the imdb cover picture. The value will correspond to the width in pixels. Delete any value to get maximum width.
bg_bg: Големина на постера.Това съотвества на широчината в поксели.Ако оставите полето празно ще бъде показана най-големият постер.

source: Options below can break a lot of things. Change them only if you know what you're doing.
bg_bg: Тези опции могат да предизвикат много конфликти. Използвай само ако занете каов правите.

source: Search, imdb part
bg_bg: Търси imdb

source: Search variant
bg_bg: Опции за търсене

source: Get rid of IMDb
bg_bg: Махни IMDb

source: This is the imdb server to use. The localized ones (i.e. italian and german) are only qualified to find the movies ID - but parsing for the details will fail at the moment.
bg_bg: Кой сървър ще бъде използван. Локален - например исталиански или немски на този етап могат само да вземат ИД но не и да показват информация.

source: Moviename search variant. There are different ways of searching a movie name, with slightly differing result sets. Set the variant you prefer.
bg_bg: Опции за търсене.Има няколко възможности за търсене с малки различия в резултатите.Изберете опция.

source: IMDb LT can use sources other than IMDb. Select here if you want to get rid of IMDb website as the main information source.
bg_bg: IMDb LT може да използва и други източници за информация(не само IMDb). Изберете тази опция ако искате да изпозлвате други източници.

source: Search, moviepilot part
bg_bg: Търсене на сюжет

source: MoviePilot language
bg_bg: Език за сюжет

source: API Pilot key
bg_bg: API Pilot ключ (key)

source: Moviepilot website offers many languages to switch to. Make your selection, and data will be rendered in language selected.
bg_bg: Moviepilot предлага много езици.Избери езикът и информацията ще бъде предоставена на съответният език.

source: If MoviePilot is missing data (i.e. it does not provide a detail at all, as user's comments), should the API try to substitute them via the IMDB class? To define this, you should use the following constants: <UL><LI>NO Access - don't access IMDb.com at all</LI> <LI>BASIC Access - access it only for very basic data. This means very non-descriptive stuff, like e.g. MPAA/FSK.</LI> <LI>MEDIUM Access - something more than BASIC, but ommit 'traceable' stuff like full descriptions, IMDb ratings, and the like</LI> <LI>FULL Access - get all we can get</LI></UL>
bg_bg: Ако сюжет липсва ( няма достатъчно информация в коментарите от потребители, трябва ли API да пробва да замести тях като използва класовете? За да дефинирате това, трябва да използвате опциите<UL><LI>Без достъп - няма да пробва изобщо IMDb.com </LI> <LI>Нормален достъп - Има достъп до много ограничена информация като MPAA/FSK.</LI> <LI>Медиум достъп - малко повече от нормален достъп пропуска информация като пълно описание, IMDb рейтинг, и the like</LI> <LI>Пълен достъп - взема всичката налична информация</LI></UL>

source: API Pilot key is usefull when data are not - either partially or completely - extracted from IMDb website (see "Get rid of IMDb" option). Look at help (how to) section for a guideline.
bg_bg: API Pilot key е добре да се използва когато информацията не не нито пълна нито частична- взета от IMDb сайт (виж "Махни IMDb" опция). Погледни помощ (how to) секция за повече информация

source: Misc
bg_bg: Разни

source: Debug mode
bg_bg: Проверка за грешки

source: Enable debug mode?
bg_bg: Активирай проверка за грешки

source: Limit results
bg_bg: Лимитирай резултати

source: Use automatical genre taxonomy?
bg_bg: Използвай автоматични жанр taxonomy

source: This the limit for the result set of researches. Use 0 for no limit, or the number of maximum entries you wish. When "direct search" option is turned to yes, this option is hidden.
bg_bg: Лимитира резултатите от търсене.Ако използвате 0 - няма лимит.За да използвате лимит поставете желаните от вас резулатати като брой ( 1,2,3, ....,n).Когато "директно търсене" опция е ДА - тази опция няма да бъде активна.

source: This will automatically add "genre" terms found for the movie into wordpress database, as <a href="http://codex.wordpress.org/WordPress_Taxonomy">taxonomy</a>. Activating this option open <a href="?page=imdblt_options&subsection=widgetoption&widgetoption=taxo">others taxonomy options</a>. Taxonomy terms are uninstalled when removing the plugin.
bg_bg: Това автоматично ще добави "жанр" търм (terms) намерени за филмът в Wordpress базата данни като <a href="http://codex.wordpress.org/WordPress_Taxonomy">taxonomy</a>.За да активирате тази опция ще можете да отворите<a href="?page=imdblt_options&subsection=widgetoption&widgetoption=taxo">други taxonomy опции</a>.Taxonomy terms се махат когато махенте плъгина.

source: Reset settings
bg_bg: Възстанови оснивно настройки

source: Update settings
bg_bg: Запази настройки

source: Search for movies with the same name
bg_bg: Търси филми с подобно заглавие

source: Search AKAs
bg_bg: Търси AKAs

source: Movie
bg_bg: Филм

source: Actors
bg_bg: Akтьори

source: Crew
bg_bg: Екип

source: no picture
bg_bg: Без постер

source: Year
bg_bg: Година

source: Runtime
bg_bg: Времетраене

source: minutes
bg_bg: минути

source: Rating
bg_bg: Рейтинг

source: Vote average
bg_bg: Гласуване:

source: Sound
bg_bg: Музика

source: Casting
bg_bg: Кастинг

source: link to imdb
bg_bg: Връзка(линк) към IMDb

source: Writer
bg_bg: Сценарист

source: click to expand
bg_bg: Щракни за още

source: Goof
bg_bg: Гаф

source: Popup link builder
bg_bg: Образуване на Popup link

source: Inside the post
bg_bg: В пост

source: Big admin menu
bg_bg: Голямо админ меню

source: Add a search form
bg_bg: Добави форма за търсене

source: Keep css through update
bg_bg: Запази css по време на обновяване(update)

source: Taxonomy with Wordpress
bg_bg: Taxonomy с Wordpress

source: How to use IMDb link transformer
bg_bg: Как да използваме IMDb link transformer

source: Frequently asked questions
bg_bg: Често задавани въпроси

source: What's new
bg_bg: Какаво ново

source: Changelog
bg_bg: Промени

source: Two ways to match <strong>IMDb link transformer</strong> and <strong>support</strong>
bg_bg: Два начина да преоткриете <strong>IMDb link transformer</strong> и <strong>Поддръжка</strong>

source: Be supported!
bg_bg: Conseguir suporte!

source: You will never believe there is so many ways to be supported. Yes, you can:
bg_bg: Няма да повярвате колко много начина за поддръжка има.Може да

source: visit
bg_bg: посетите

source: to ask for support.
bg_bg: за поддръжка.

source: check
bg_bg: провери

source: Support me!
bg_bg: Помогнете!

source: You will never believe there is so many ways to thank me. Yes, you can:
bg_bg: Няма да повярвате колко много начина има за да ми благодарите. Можете да:

source: vote for IMDb link transformer on
bg_bg: Гласувате ЗА IMDb link transformer no

source: vote for IMDb link transformer on its own
bg_bg: гласувате за IMDb link transformer собствения сайт -

source: send as many bugfixes and propositions as you can on IMDb link transformer website.
bg_bg: Пращайте вззички грешки и предложения за IMDb link transformer.

source: pay whatever you want on paypal
bg_bg: подкрепете с колкото можете

source: website
bg_bg: Сайт

source: translate the plugin into your own language.
bg_bg: преведи плъгина на собственият си език

source: help me to improve the plugin's design. I'm not gifted at all.
bg_bg: Помогнете да подобря дизайнът.Аз не съм Гуру :) .

source: place a trackback, talk about this tool, and so on.
bg_bg: поставете trackback, talk about this tool, и т.н.

source: Special thanks to:
bg_bg: Специални благодарнисти:

source: Why a popup window?
bg_bg: Защо изкачащ прозорец (Popup)?

source: The first way to use Imdb link transformer is the first historically available. The idea behind was to find a solution for posts quoting many movies; blogger and reader would appreciate to have director's name, to know the alternative title's name, etc. And these data should not waste space in post itself; thus the popup idea.
bg_bg: Първият начин за използван на Imdb link transformer е исторически и все още достъпен.Идеята е да се намери решение за постове които да показват много информация за много филми.Блогъри и читатели ще се радват да имат повече информация за филмът, да видят другите имена на филмът и т.н. Това е идята да има popup а не да се заема място в самият пост.

source: Popup, as an extra window opened on click, will permit to get director's and movie's data; it is fully browsable and when browsing a movie, one can also look for 'AKAs' (movies which have a name similar).
bg_bg: Popup, като екстра позволява само с едно щракване да получите повече информация за филмът; напълно достъпен е за сърфиране и може да се намери информация като 'AKAs' (филми които имат подобни имена).

source: It is quite intuitive to understand how popup can help; when writing about many movies, if one would like to speak about every director or actor he mentions in his post, it would take ages and will not have the power of the linkage (once seen the director, looking for his filmography).
bg_bg: За да разберете какво точно е предимството да използвате този изкачащ прозорец(Popup), трябва да пишете много за филми и ако искате да покажете повече инфомация за създателите на филма ще ви отнеме много време за да я намерите с Google.

source: How to get a popup window
bg_bg: Kak да активирате popup window

source: Or you use the Visual style to write posts, and a new button could help you to achieve that :
bg_bg: Или като използвате Visual style да пишете постове - нов бутон ще помогне да постигнете това:

source: Whatever the tool you choose, when you will save your post you will get a nice link added to your movie.
bg_bg: Която и опция д аползвате в моментът в който запазите постът, нов линк (връзка) ще бъде създаден

source: Why to use widget?
bg_bg: Защо да използваме widget?

source: key and value for custom fields
bg_bg: ключ(key) и стойност(value) на custom field

source: Widgets are widely used in wordpress. They allow to quickly select what information to display in an area, usually on sidebar. The main advantage is that blogger can easily select what information to display - or not, in what order.
bg_bg: Widgets се използват много в WordPress. Те позволяват бързо и лесно да изберете информацията която искате да покажете (нормално в sidebar). Предимството е че може да се избере лесно каква инфомация да бъде показана и каква не, както и редът в който да бъде показана.

source: How to use widget
bg_bg: Как да използваме widget

source: <strong>Firstly</strong>, go to <a href='widgets.php'>widget</a> administration (<i>appearance</i> tab), drag <i>imdb widget</i> (from <i>inactive widgets</i>) to a sidebar, and modify the box's title (in case you don't want to have the box named <i>IMDb data</i>).
bg_bg: <strong>Първо</strong>, отиди <a href='widgets.php'>widget</a> administration (<i>appearance</i> tab), премести <i>imdb widget</i> (от <i>inactive widgets</i>) в sidebar.Промени заглавието в случай че заглавието трябва да е различно от <i>IMDb data</i>.

source: <strong>Secondly</strong>, open an old post (or write a new one) and add the key <i>imdb-movie-widget</i> to the <i>custom fields</i> of your message <strong>and</strong> the name of the movie you want to display to <i>value</i> (first case from the picture). IMDb link transformer will automatically display in the widget the movie selected.
bg_bg: <strong>Второ</strong>, отвори стар пост (или зпочни нов) добави ключ (key) <i>imdb-movie-widget</i> в <i>custom fields</i> на твоя пост <strong>и</strong> името на гилмът който искаш да покажеш като <i>value</i> (първият случай от картинката). IMDb link transformer автоматично ще покаже в widget избраният филм.

source: IMDb link transformer widget
bg_bg: Widget IMDb link transformer

source: <strong>Another possibility:</strong> add to your post the key <i>imdb-movie-widget-bymid</i> into the <i>custom fields</i> from your message <strong>and</strong> the IMDb ID for the movie you want to be displayed on your sidebar to <i>value</i> (second case from the picture). Instead of looking for a name, IMDb link transformer would directly display the movie you want to display. Very useful when your movie's name does not work as it should (if there are many movies with the same name, the wrong movie is displayed, etc).
bg_bg: <strong>Друга възможност:</strong>добави към постът, ключ (key) <i>imdb-movie-widget-bymid</i> в <i>custom fields</i> към твоят пост с IMDb ID за гилмът който искаш да бъде показн на твоят sidebar (втори случай от картинката). Вместо да търси по име, IMDb link transformer директно ще покаже филлмът под това ID. Това е полезно в случаите когато заглавията за на филмите не се показват точно както искате(когато има много филми с отва име, грешен филм се показва и т.н.).

source: To get the movie's IMDb id, search for a title on <a href='http://www.imdb.com' >Internet movie database</a> website, look at the adress bar for a 'ttXXXXX' section, keep only the numerical part (XXXXX) and add result to the <i>value</i> custom field. However, in this specific case, do not mix with an <i>imdb-movie-widget</i> key. Only the first one will be displayed.
bg_bg: За да вземето IMDb id за филмеът, търсето по име на филмът <a href='http://www.imdb.com' >Internet movie database</a>, погледнте в адрес на страницата и намерете 'ttXXXXX', вземете само номерата като част (XXXXX) и ги поставете като съдържание в <i> custom field</i>.В този случай недейте да бъркате <i>imdb-movie-widget</i>.Само путият ще бъде показан.

source: What's the point of displaying movie's data inside my post?
bg_bg: Защо да показвам инфомация за филмът в пост?

source: Having movie's data inside the post is quite useful; it could ingeniously decorate your message, display crucial informations (director, actors) and in the same time add links to a popup which would include these informations (but with more details). At the begining, this function could only be achieved with a special plugin. Since release 1.1.14.3, IMDb link transformer does not need any third party plugin anymore to display movie's data inside you message.
bg_bg: Имайки тази информация в пост, тя го прави по инфомативен и показва повече информация като сценарист, режисьор.В този случай също така опциятя popup е активан и в прозорецът можете да намерите повече информация.В началото това беше възможно с допълнителна функция но след версия 1.1.14.3, IMDb link transformer няма нужда от допълнителни плъгини да бъдат инсталирани за да показва информацията за филмът.

source: It means that you only need to put the movie's name into brackets, to get movie's data inside your post.
bg_bg: Означава че само трябва да поставите името на филмът в скоби, за да покажете информацията в пост.

source: How to display data inside my post
bg_bg: Как да покажем информация в пост

source: You only need to put the movie's name into brackets, to get movie's data inside your post. Data can be inserted exactly where you want, there is no limitation. Just be sure to put the movie's name inside [imdblt][/imdblt], like this:
bg_bg: Само трябва да поставите името на филмът в скоби, за да получите желаният резултат.Информацията може да бъде поставена точно където искате.Само трйабва да сте сигурни, че името на филмът е м/у таговете [imdblt][/imdblt], както следва:

source: IMDb link transformer Inside a post
bg_bg: IMDb link transformer в пост

source: And you are done.
bg_bg: Готово!

source: You additionnaly can get a movie from its imdb id, using its imdb movie's id instead of its name. When writing your post, put the movie's imdb id inside tags [imdbltid][/imdbltid] (which gives ie [imdbltid]0137523[/imdbltid], for Fight Club movie). You can get movie's imdb id from imdb website, search for you movie, and check your browser's adress bar. The number after 'tt' part is the movie's id.
bg_bg: Също така можете да покажете информацията за филм чрез imdb id а не с името на филмът. Когато пищете пост поставете ИД-то в [imdbltid][/imdbltid] ( пример: [imdbltid]0137523[/imdbltid] за Fight Club movie). ИД-то може да се вземе то сайт imdb, като направите търсене по заглавие и вземето от адресът цифрите след tt.

source: It could happen you don't want to use the previous solution to display movie's data. For exemple, if you wish to use IMDbLT outside a post (in a personalized page), it won't work. In this case, and in this case only, you should (may be) to download Exec-PHP plugin (<a href='http://wordpress.org/extend/plugins/exec-php'>http://wordpress.org/extend/plugins/exec-php</a>), depending of your page.
bg_bg: Може да искате да използвате друг начин за да покажете инфомация за филм в пост. Ако искате да използвате IMDbLT извън пост ( пример: страница), няма да работи. В този случай трябва да използвате още един плъгин, който се казва Exec-PHP plugin (<a href='http://wordpress.org/extend/plugins/exec-php'>http://wordpress.org/extend/plugins/exec-php</a>), зависи от случаят.

source: The function to be called is <strong>imdb_call_external ()</strong>. It has two parameters, and both are mandatory. The first is the movie's name, and the second take always 'external'. For exemple, one'd like to display 'The Descent' should call the function like this:
bg_bg: Функцията която трябва да извикате (call) е <strong>imdb_call_external ()</strong>. Трябва да използвате две стойности(и двете са задължителни)Първата е името на филмът, а втората е винаги 'external'.Пример за: 'The Descent'

source: The function can also be called using still 'external as second parameter, but the first will be blank and a new third parameter will take its IMDb movie's ID. For exemple, one'd like to display 'The Descent' should call the function this manner:
bg_bg: Функцията може да се използва и като запазим 'external' като втори параметър и прибавим трети такъв IMDb movie's ID. Пример за 'The Descent' с ИД:

source: I like to display movie details, but I want to get rid of links which open a popup
bg_bg: Искам да показа информация за филм, но без отварящ се прозорец (popup)

source: It could happen you do not want popups at all. Since by default IMDb link transformer add links whenever relevant to movie's details displayed inside posts, one may find this useless. To get rid of them, look for 'Widget/Inside post Options / Misc / Remove popup links?' and switch the option to 'yes'. No links are created anymore, for both widget and inside a post.
bg_bg: Може вие да не искате да показвате popups. Нормалните IMDb link transformer настройки добавят връзки ( линкове )в постовете , но има хора които намират това за безполезно. За да премахнете тези връзки (линкове) погледни за опции Widget/В пост' / Разни / Премахни изкачащ прозорец (popup)? и използвай опцията Да. Няма да бъдат създадени линкове в двата случая: widget и в пост .

source: IMDb link transformer is a mess! I'm lost with so many options.
bg_bg: IMDb link transformer е хаос.Изгубих се в толкова много опции
