Repository: jcvignoli/lumiere-movies
Catalog: language/imdb-*.po
Languages: bg_bg

source: Wordpress admin area offers more and more options to user. Starting with 2.7 release, it also offers the possibility to add new admin menu for plugins. IMDb link transformer makes the most of this possibility, and can add its own admin menu. It can be added - or removed. Depending of how many plugin's admin menus you already have, you would prefer to keep access to IMDb link transformer settings only through usual 'settings' tab; it's up to you to choose to either get a complet and bigger IMDb link transformer menu - or not.
bg_bg: WordPress предлага много опции за потребителите.С версия 2.7, предлага възможноста да се създаде меню за плъгини.. IMDb link transformer е един от плъгините които могат да имат свое собствено меню. Може да бъде добваен или премахнат.Зависи колко плъгин менюта искате да имате и колко такива вече имате. IMDb link transformer може също така да бъде конфигуриран през 'settings' tab без проблеми. Зависи коя опция е по добра за вас, можете да изберете да имате отделно админ меню или да продължите да използвате стандартния наяин на конфигуриране.

source: In the case you want to, go to 'General options / Advanced / Display plugin in big admin menu' and turn to 'yes' the option. You will get a brand new menu, as shown on left.
bg_bg: В този случаи искате да отидете до Основни настройки / / Разширени / Покажи плъгин в админ меню и изплозвайте ДА като опция. Ще получито ново меню

source: One can go still further; if installing <a href='http://planetozh.com/blog/my-projects/wordpress-admin-menu-drop-down-css/ '>Ozh Admin Drop Down Menu</a>, a plugin to switch classical vertical admin menu to horizontal and which gives the admin area more of a 'desktop application' feel. IMDb link transformer is ready to use improvements from Ozh's plugin, adding icons (when user select IMDb's plugin from the settings menu). Also, if you activate both Ozh's plugin and IMDb link transformer's big admin menu, you will get a nice and complete horizontal menu. Very useful.
bg_bg: Някой може също така да направи повече, ако инсталирате <a href='http://planetozh.com/blog/my-projects/wordpress-admin-menu-drop-down-css/ '>Ozh Admin Drop Down Menu</a>,плъгин, който позволява да напрвите вертикално меню а не стандартното вертикално. IMDb link transformer е готов да използва подобрение от плъгинът на Ози, добавчне на икони ( когато потребителят избира плъгинът от меню).Също така ако активирате двата плъгина ще получите наистина добро хоризонтално меню.

source: How to add a search function for movies in general, and not only for selected movies?
bg_bg: Как да добавим функция за търсене на филми а не да показваме смао избрани.

source: It is indeed doable. Plugin is versatile enough to handle this function. By adding a form, you can add a search field which will allow users to search for every movie on your blog. Here is the code:
bg_bg: Плъгинът позволява чрез добавяне на допълнителен код, посетителите на вашият блог да правят търсене за други филми.

source: It perfectly fits in your sidebar, for exemple.
bg_bg: Показва се в sidebar без проблеми

source: How to keep my own css through updated process?
bg_bg: Как да запазим изглед(css) по време на обновяване(updated)

source: Fed up of losing your carefully handmade visual settings at every IMDbLT update? There is a solution.
bg_bg: Няма нужда да се ядосвате поради загубване на вашият изглед (css) по време на всяко IMDbLT обновяване(update)? Има решение.

source: Every modification you can make is done in css/imdb.css file. Instead of using this file, put an imdb.css file in you template root folder; this css file will taken instead of plugin's css file. Whenever you update, your template's one will stay untouched!
bg_bg: Всяка промяна която правите е в запазена в css/imdb.css файл.Вместо да ползвате този файл, в директорията на темплейтът който използвате, сложете imdb.css и той ще бъде използван.Когато и да обновявате ваяийт плъгин, този в темплейт директорията ще остене непорменен.

source: However, be careful with this manner, since css/imdb.css file can be updated from version to version, and you'd not be aware of changes made...
bg_bg: Внимание! Файлът може да бъде променен със следваща версия. Провярвайте съдържанието на оригиналният файл след обновяване.

source: How to switch to another website other than IMDb?
bg_bg: Как да използваме друг източник на информация

source: Starting with IMDbLT 1.6 release, you have the opportunity to use other website source than IMDb.
bg_bg: С IMDbLT 1.6 release вече можете да използвате други сайтове, освен IMDb.

source: Since IMDb website's licence of use is quite protective, you may choose to use Moviepilot website instead (could have more choices in far future). To completely comply with legal obligations, follow these steps:
bg_bg: Тъй като лицензът на IMDb е много стриктен, може да използвате Moviepilot( може и повече опции да има с новите версии ).За да сте изцяло легални следвайте тези стъпки:

source: You need an API key from moviepilot.com. Send an email to api@moviepilot.de asking for an API key, and copy-paste the code you have been given in 'General options -> Advanced -> Search, moviepilot part-> API Pilot key' field.
bg_bg: Имате нужда от API key от moviepilot.com. Изпрати е-маил на api@moviepilot.de asking за API key и постави кодът в Основни опции ->Разширени->Търсене, жанр част -> API Pilot key'поле

source: For a preformatted email
bg_bg: Готов е-майл ( образец )

source: click here
bg_bg: щракни тук

source: Switch 'Get rid of IMDb' option to 'on'
bg_bg: Щракни за да използващ опцията 'Премахни IMDb'

source: You may now select both your local language and the accuracy level to comply with (IMDb behaviour).
bg_bg: Сега можете да изберете езикът който искате и верният достъп за IMDb

source: What is Wordpress' taxonomy?
bg_bg: Какво е Wordpress 'taxonomy'?

source: Starting with Wordpress 2.3, plugins makers can use <a href='http://codex.wordpress.org/WordPress_Taxonomy'>taxonomy</a>.
bg_bg: С версия на Wordpress 2.3, стана възможно използването на <a href='http://codex.wordpress.org/WordPress_Taxonomy'>taxonomy</a>.

source: Taxonomy is a feature adding a supplementary categorisation beside Categories and Tags; in other words, it is like having species (a block named 'genre') and subspecies (few words describing the genre, like 'Adventure', 'Terror'). It is not fundamentaly different from Categories and Tags, but it is much more appropriate for IMDb Link Transformer needs.
bg_bg: Taxonomy е възможност, чрез която може да групирате по начини други освен категории и тагове, това е като да имате видове и подвидове(пример: вид -> жанр подвид-> прикюченски, екщън ...).Не е точно като категории и тагове но е по използваемо за нуждите на IMDb Link Transformer.

source: How to use taxonomy Wordpress capability?
bg_bg: Как да използваме възможностите на taxonomy в Wordpress

source: To activate the automatically generated taxonomy, turn 'General options -> Advanced -> 'Use automatical genre taxonomy?' to 'yes'. Of course, since taxonomy is to a movie detail related, the movie detail you want to be used as taxonomy has to be also activated from 'Widget/Inside post Options -> What to display'. Eventually, it will permit to select in 'Widget/Inside post Options -> What to taxonomize' menu if you want to taxonomize Genres, but also actors, colors, composers, directors and so on.
bg_bg: За да активирате автоматичното генериране на taxonomy, използвайте Основни опции -> Разширени -> Използвай автоматично жанр taxonomy. Проверете дали тази опция е съще така активирана в 'Widget' секцията ( в противен случай няма да можете да ползвате автоматични taxonomy).

source: After that, pay a visit to your post/page; first refresh will not immediately display the movie detail (it will only generate them). Though, on a second refresh, you will see both movie details and (if you wordpress theme is configured to show it) taxonomy in your post.
bg_bg: Моля за внимание.След първо посещение обърнете внимание, че няма автоматично да покаже информацията за филмът а само ще бъдат генерирани.След обновяване на страницата с F5 ще видете и двете - информацията за филмът и taxonomy в постът който сте създали.

source: New option(s) in 'Posts' menu
bg_bg: Нови опции в пост меню

source: Once you have activated all taxonomy options and have triggered its wordpress function (by visiting your post and refreshing the page), wordpress administration posts menu will include new option(s). Depending on movie details previously selected, you will find an option to manage the words automatically generated by the taxonomy function. For instance to select 'genre':
bg_bg: Когато активирате всички taxonomy опции и сте посетили вече създаден пост, във вашето меню ще се появят нов опции.От това каки опции сте избрали за информация за филмът, ще имате възможност да редактирате думите създадени автоматично като taxonomy. За пример вземете: жанр:

source: Also, select cautiously options you want to be displayed as taxonomies: it could happen it creates a conflict with other functions, especially if you display many movies in same post. When selecting one of the taxonomy options from 'What to taxonomize' section, it will supersede any other function or link created; for instance, you won't have anymore access to popup links for directors, if directors taxonomy is chosen. Taxonomy will always prevail.
bg_bg: Внимавайте какво опции искате да покажете като таксоми, защото може да везникне проблем (конфликт) с други функции, и още повече в случаите когато показвате повече от един филм в един пост.Когато изберете опцията за таксоми всички останали функции ще бъдат заместени: например няма да имате достъп до показващите се прозорци за Режисьор ако опцията за Режисьор е избрана.Таксоми винаги е на по високо място и деактивира останалите възможности

source: Advanced: Customizing your theme according taxonomy
bg_bg: Разширени: Направете вашият темплейт съвместим с taxonomy

source: To fully enjoy this feature, copy the file in IMDb link transformer folder 'theme/taxonomy-genre.php' to your 'theme' folder. Customize this page according to your tastes and theme design. The design is the same as (ie) the tag.php file.
bg_bg: За да усетите напално тези възможности, копирайте файлът от деректорията на IMDb link transformer 'theme/taxonomy-genre.php'в директорията на вашата тема. Можете да направите допълнителна обратка на изгледът по ваше желание ( P.S. дезайнът е същият кто при tag.php)

source: Back
bg_bg: Назад

source: Filmography
bg_bg: Филмография

source: Biography
bg_bg: Биография

source: Born on
bg_bg: Роден на

source: in
bg_bg: в

source: Died on
bg_bg: Починал на

source: cause
bg_bg: причина

source: Biographical movies
bg_bg: Биографичен филм

source: Nicknames
bg_bg: Прякор

source: Personal quotes
bg_bg: Лични цитати

source: Trademarks
bg_bg: Запазена марка

source: Search
bg_bg: Търсене

source: Please wait while data is retrieved... <br />Process can take some time.
bg_bg: Моля изчакайте докато информацията се зареди ... <br /> Процесът може да отнеме време.

source: Cache is crucial to IMDb link transformer operation. As first imdb searchs are quite time consuming, if you do not want to kill your server but instead want quickest browsing experience, you will use cache. Pay a special attention to directories that need to be created.
bg_bg: Използването на кеш е много решаващ за финкциите при използване на IMDb link transformer. Търсенето отнема доста време и ако не искате да натоварите много сървърът на който работие както и да подобрите сърфирането трябва да използвате кеш. Обърнете специално внимание на директориите ( папките ), които трябва да създадете.

source: Cache directory (absolute path)
bg_bg: Кеш директория ( папка ) ( абсолютен път )

source: Cache size is currently
bg_bg: Големината на кеш в момент е:

source: Folder exists.
bg_bg: Директорията ( папката ) съществува.

source: Folder doesn't exist!
bg_bg: Няма такава директория ( папка )!

source: Permissions OK.
bg_bg: Правата са OK.

source: Check folder permissions!
bg_bg: Провери права за директориите ( папките )!

source: Absolute path to store data retrieved from the IMDb website. Has to be <a href="http://codex.wordpress.org/Changing_File_Permissions" title="permissions how-to on wordpress website">writable</a> by the webserver.
bg_bg: Абсолютен път до директорията ( папката ) където да се запази информацията от IMDb. Трябва да бъде <a href="http://codex.wordpress.org/Changing_File_Permissions" title="permissions how-to on wordpress website">разрешено за запис</a> от сървърът.

source: Photo directory (absolute path)
bg_bg: Постър директория ( папка )(абсолютен път )

source: Absolute path to store images retrieved from the IMDb website. Has to be <a href="http://codex.wordpress.org/Changing_File_Permissions" title="permissions how-to on wordpress website">writable</a> by the webserver.
bg_bg: Абсолютен път до директорията ( папката ) където да се запазват постерите от IMDb. Deve permitir <a href="http://codex.wordpress.org/Changing_File_Permissions" title="permissions how-to on wordpress website">разрешено за запис</a> от сървърът.

source: Photo directory (url)
bg_bg: Постър директория ( папка ) (URL)

source: URL corresponding to photo directory.
bg_bg: URL който да отговаря на папката ( директорията ) с постъри

source: Cache general options
bg_bg: Основни опции за кеш

source: Store cache?
bg_bg: Запази кеш?

source: Use cache?
bg_bg: Използвай кеш?

source: Cache expire
bg_bg: Кеш - валидност

source: (never)
bg_bg: (никога)

source: Whether to store the pages retrieved for later use. When activated, you have to check you created the folders
bg_bg: Дали да запазва страниците получени от източникът на инфомация за използване покъсно.Ако активирате, моля проверете дали директориите ( папките ) са създадени.

source: Cache directory
bg_bg: Кеш директория ( папка )

source: and
bg_bg: и

source: Photo directory (folder)
bg_bg: Постер директория ( папка )

source: Whether to use a cached page to retrieve the information (if available).
bg_bg: Дали да ползва запазените странице, които вече веднъж са били полуяени(ако са на раположение в кеш).

source: Cache files older than this value (in seconds) will be automatically deleted. Insert "0" or click "never" to keep cache files forever.
bg_bg: Кеш файлове постари от тази стойност ( в секунди ) ще бъдат автоматично изтрити.Сложете "0" или щракнете "никога" за да запазите файловете и забраните изтриването

source: (one month)
bg_bg: (един месец)

source: Cache zip options
bg_bg: Кеш опция - zip

source: Convert to zip?
bg_bg: Конвертирай в zip?

source: Use zip?
bg_bg: Използвай zip?

source: Convert non-zip cache-files to zip (check file permissions!)
bg_bg: Конвертирай non-zip кеширани файлове в zip (провери правата в/у файловете!)

source: Use zip compression for caching the retrieved html-files.
bg_bg: Използвай zip компресия за кеширане и извикване на html файлове

source: Cache details
bg_bg: Кеш в детайли

source: Show advanced cache details
bg_bg: Покажи разширена информация за кеш

source: No file found in cache folder.
bg_bg: Няма намерени файлове в кеш директорията

source: Delete cache
bg_bg: Изтрий кеш

source: Warning!
bg_bg: Внимание!

source: This button will to delete specific cache files selected from cache folder.
bg_bg: Този бутон ще изтрие избраният от вас кеш от директорията ( папка ) кеш

source: Global cache
bg_bg: Глобален кеш

source: If you want to reset the entire cache (including names & pictures cache) click on "reset cache". Beware, there is no undo.
bg_bg: Ако искате да премахнете целият кеш (включително имена и постери ) щракнете на "нулиране на кеш". Внимание - изтритото няма как да се възстанови.

source: Delete all cache
bg_bg: Изтрий целият кеш

source: This button will <strong>delete all cache</strong> stored in cache folder.
bg_bg: Този бутон ще <strong>изтрие целият кеш</strong> запазен в кеш директорията ( папка ).

source: open a new window with IMDb informations
bg_bg: Отвори нов прозорец с IMDb информация

source: <strong>Licensing Info:</strong> Under the GPL licence, "IMDb link transformer" is based on <a href="http://www.izzysoft.de">imdbphp project</a> classes. However, a huge customization work has been required to implement it to wordpress; check support page for
bg_bg: <strong>Лиценз:</strong> Регистриран по GPL licence, "IMDb link transformer" е базиран на <a href="http://www.izzysoft.de">imdbphp project</a>. Бъпреки това имаше нужда от доста допълнителна работа за да може да се използвва с Wordpress; провери страницата за подръжк

source: more
bg_bg: още

source: IMDb data
bg_bg: IMDb информация

source: Title:
bg_bg: Заглавие:

source: votes, average
bg_bg: гласуване за филма

source: (max 10)
bg_bg: (максимално 10)

source: vote average
bg_bg: гласуване

source: out of 10
bg_bg: от 10

source: votes
bg_bg: гласа

source: User's comment
bg_bg: Потрбителски коментар

source: Also known as
bg_bg: Известен като

source: Link to local imdb
bg_bg: Линк(връзка) към локална IMDb

source: What to display
bg_bg: Какво да покажа

source: Display order
bg_bg: Ред на показване

source: <i>Widget</i> and <i>Inside a post</i> settings
bg_bg: Настройки за <i>Widget</i> и <i>В пост</i>

source: Title
bg_bg: Заглавие

source: Picture
bg_bg: Постер

source: Display the title
bg_bg: Покажи заглавието

source: Display the picture
bg_bg: Покажи постер

source: Display the runtime
bg_bg: Покажи времетраене

source: Display directors
bg_bg: Покажи режисьор

source: Display country
bg_bg: Покажи държава

source: Display (how many) actors
bg_bg: Покажи (колко) актьори

source: Display Creator
bg_bg: Покажи

source: Display release year. Year will appear next title's movie, in brackets.
bg_bg: Покажи дата на премиера. Годината ще бъде показана до заглавието в скоби

source: Display genre(s)
bg_bg: Покажи жанр(ове)

source: Display writers
bg_bg: Покажи Сценаристи

source: Display producer(s)
bg_bg: Покажи продуцент(и)

source: Goofs
bg_bg: Гафове/грешки

source: Users comment
bg_bg: Потребителски мнения

source: Quotes
bg_bg: Цитати

source: Display (how many) goof
bg_bg: Покажи (колко) гафа

source: Display (how many) users' comments
bg_bg: Покажи (колко) мнения

source: Display (how many) quotes from movie
bg_bg: Покажи (колко) цитата

source: Colors
bg_bg: Cores

source: Display (how many) tagline
bg_bg: Покажи (колко) tagline

source: Display colors
bg_bg: Покажи cores

source: Display all movie's names
bg_bg: Покажи всички имена на филмът

source: Display composer
bg_bg: Покажи compositor

source: Display (how many) soundtrack
bg_bg: Покажи (колко) саундтрака

source: Display (how many) movie connections
bg_bg: Покажи (колко) връзки

source: Official websites
bg_bg: Официален сайт

source: Display official websites
bg_bg: Покажи официален сайт

source: Display rating
bg_bg: Покажи рейтинг

source: Display language(s)
bg_bg: Покажи език (езици)

source: Display website source at the end of the post
bg_bg: Покажи източникът на информация в края на пост

source: Please <a href="?page=imdblt_options&generaloption=advanced">activate taxonomy</a> priorly<br /> to access taxonomies options.
bg_bg: Моля <a href="?page=imdblt_options&generaloption=advanced">активирай taxonomy</a> първо<br /> за да имате достъп до taxonomies настройките.

source: Select details to use as taxonomy
bg_bg: Избери какво да се използва като taxonomy

source: Use the checkbox to display (or not) details. When activated, details names are turned to blue. Check the box to turn it back to black (and thus deactivating detail as taxonomy).
bg_bg: Използвай опциите за да показва (или не) детайли.Когато е активирано, ще видите опциите в синьо.Избери опцията още веднъж за да стане черна ( и съответно да деактивирате опцията за taxonomy

source: Select cautiously options you want to be displayed as taxonomies: it could happen it creates a conflict with other functions, especially if you display many movies in same post. When selecting one of the following taxonomy options, it will supersede any other function or link created; for instance, you won't have anymore access to popup links for directors, if directors taxonomy is chosen. Taxonomy will always prevail.
bg_bg: Внимавайте какво опции искате да покажете като таксоми, защото може да везникне проблем (конфликт) с други функции, и още повече в случаите когато показвате повече от един филм в един пост.Когато изберете опцията за таксоми всички останали функции ще бъдат заместени: например няма да имате достъп до показващите се прозорци за Режисьор ако опцията за Режисьор е избрана.Таксоми винаги е на по високо място и деактивира останалите възможности.

source: Position of data
bg_bg: Разположение

source: "Source" movie detail cannot be selected; if it is selected from "what to display" section, it will always appear after others movie details
bg_bg: "Източник на информация" винаги ще е на поседледна позиция, в случай ако е избран в опциите "какво да покажа"

source: Auto widget?
bg_bg: Автоматично използвай widget

source: Add automatically a widget according to post title. If 'imdb-movie-widget' or 'imdb-movie-widget-bymid' have also been added to post, the auto widget will be displayed before them.
bg_bg: Добавя автоматично информация според заглавието на поста.Ако 'imdb-movie-widget' или 'imdb-movie-widget-bymid' поле също се добави към пост, автоматичния widget ще бъде показан преди тях.

source: Permanent Link to
bg_bg: Директен линк(връзка) към

source: Filed under:
bg_bg: Регистриран под:

source: Tags:
bg_bg: Тагове:

source: No post found.
bg_bg: Няма открит пост
