Repository: jcvignoli/lumiere-movies
Catalog: src/languages/lumiere-movies-*.po
Languages: fr_fr

source: Whether to keep or delete Lumière! settings upon plugin uninstall. When unticked, uninstalling this plugin will delete all taxonomy terms, Lumière databases, taxonomy templates in your theme folder, and your cache folder. For the safety of your WordPress install, metaboxes data in your posts, custom data fields in your posts and Lumière widget added will never be removed.
fr_fr: Conserver ou supprimer les paramètres de Lumière! lors de la désinstallation de l’extension. Si la case est décochée, la désinstallation de cette extension supprimera tous les termes de taxonomie, les bases de données Lumière, les modèles de taxonomie dans le dossier de votre thème, et votre dossier de cache. Pour la sécurité de votre installation WordPress, les boîtes méta de vos articles, les champs de données personnalisés de vos articles et le widgets Lumière ajoutés ne seront jamais supprimés.

source: Add an extra delay in seconds to avoid IMDb website throwing HTTP 504 errors (too many requests).
fr_fr: Ajoutez un délai supplémentaire en secondes pour éviter que le site de l’IMDb n’envoie des erreurs HTTP 504 (trop de demandes).

source: Delay queries time
fr_fr: Temps pour retarder les requêtes

source: Limit of the number of results in a movie query. That limitation will impact the number of movies shown in the popup with movies and director search results.
fr_fr: Limite du nombre de résultats d’une recherche de films. Cette limite aura une incidence sur le nombre de films affichés dans la fenêtre surgissante contenant les résultats de la recherche de films et de réalisateurs.

source: Podcasts only
fr_fr: Podcasts uniquement

source: Automatically refresh the cache over a span of two weeks. Selecting this option will remove the time expiration of the cache, which will be automatically set to forever.
fr_fr: Actualiser automatiquement sur deux semaines. En sélectionnant cette option, vous supprimez l’expiration de la durée du cache, qui n’expirera plus jamais.

source: Cache auto refresh
fr_fr: Actualisation automatique du cache

source: Current size used:
fr_fr: Taille actuellement utilisée :

source: Allows faster loading time for the "manage cache" option page by taking out pictures and limiting options for movies and people cache. Useful when you have too many cache details to display.
fr_fr: Permet d’accélérer le temps de chargement de la page d’option « gérer le cache » en supprimant les images et en limitant les options pour les films et le cache des personnes. Utile lorsque vous avez trop de cache à afficher.

source: Manage cache page
fr_fr: Page de gestion du cache

source: Absolute path to store images retrieved from the IMDb website. Has to be %1$swritable%2$s by the webserver.
fr_fr: Chemin absolu pour stocker les images récupérérées sur le site internet de l’IMDb. Doit être %1$saccessible en écriture%2$s par le serveur internet.

source: Absolute path to store cache retrieved from the IMDb website. Has to be %1$swritable%2$s by the webserver.
fr_fr: Chemin absolu pour stocker le cache récupéré sur le site internet de l’IMDb. Doit être %1$saccessible en écriture%2$s par le serveur internet.

source: %1$s file using %2$s
fr_fr: %1$s fichier utilisant %2$s

source: %1$1s file using %2$2s
fr_fr: %1$1s fichier utilisant %2$2s

source: %1$sLicensing Info:%2$s Under a GPL licence, based on various libraries. However, a lot of work is required to implement it in WordPress and maintain it; check the support page for %3$smore information%4$s.
fr_fr: %1$sInformations sur les licences : %2$s Sous licence GPL, basé sur plusieurs bibliothèques. Cependant, beaucoup de travail a été nécessaire pour l’intégrer à WordPress et le maintenir ; consultez la page de support pour %3$splus d’information%4$s.

source: Please %1$sactivate taxonomy%2$s before accessing to taxonomy options.
fr_fr: Veuillez %1$sactiver la taxonomie%2$s avant d’accéder aux options de taxonomie.

source: Nounce error
fr_fr: Erreur de nonce

source: Every two weeks
fr_fr: Toutes les 2 semaines

source: Could not get the credentials wp_filesystem for copying
fr_fr: Impossible d’obtenir les informations d’identification wp_filesystem pour la copie

source: Main
fr_fr: Principal

source: You can now visit pages that include all your posts grouped by movie details. For instance, if you write a lot about the same movie director, the taxonomy page will include all your posts written about them.
fr_fr: Vous pouvez maintenant visiter des pages qui comprennent tous vos articles groupés par détails de films. Par exemple, si vous écrivez beaucoup sur un même réalisateur, la page de taxonomie comprendra tous vos article le concernant.

source: Lumière has been deactivated and cannot be activated again unless you deactivate them all.
fr_fr: Lumière! a été désactivée et ne peut être réactivée que si vous les désactivez tous.

source: You can increase the limit of results in the admin options.
fr_fr: Vous pouvez augmenter la limite de résultats dans les réglages d’administration.

source: Get support and support me
fr_fr: Obtenez de l’aide et soutenez-moi

source: Unless you changed your environment or use multisite WordPress, Lumière! path should be:
fr_fr: A moins que vous n’ayez changé votre environnement ou que vous utilisiez WordPress en multisite, le chemin de Lumière! devrait être :

source: The path must end with a final slash.
fr_fr: Le chemin doit se terminer par une barre oblique.

source: In most cases, you should not edit it. Only advanced users should change this value.
fr_fr: Dans la plupart des cas, vous ne devriez pas la modifier. Seuls/les les utilisateurs/utilisatrices avancés/ées devraient modifier cette valeur.

source: Lumière! path
fr_fr: Chemin de Lumière!

source: Display plots. This field may require much size in your page.
fr_fr: Afficher les intrigues. Ce champ peut nécessiter beaucoup de place dans votre page.

source: Although we are bound ourselves to the <a href="%s">IMDb privacy policy</a> when retrieving information from IMDb, Lumière Movies WordPress plugin does not collect data by itself. You remain anonymous to IMDb by visiting our website, your data is not sent to any third-party.
fr_fr: Bien que nous soyons liés à la <a href="%s">politique de confidentialité d’IMDb</a> lorsque nous récupérons des informations d’IMDb, l’extension WordPress Lumière Movies ne collecte pas de données d’elle-même. Vous restez anonyme pour IMDb en visitant notre site web, vos données ne sont pas envoyées à des tiers.

source: What personal data does Lumière Movies plugin collect?
fr_fr: Quelles sont les données personnelles collectées par l’extension Lumière Movies ?

source: Maximum number of results reached.
fr_fr: Nombre maximum de résultats atteint.

source: Update template
fr_fr: Mettre à jour le modèle

source: Update your taxonomy template in your theme folder.
fr_fr: Mettez à jour votre modèle de taxonomie dans le dossier de votre thème.

source: Create a taxonomy template into your theme folder.
fr_fr: Créez un modèle de taxonomie dans votre dossier de thèmes.

source: Keep the cache folder size below a limit. Every hour, WordPress will check if your cache folder is over the selected size limit and will delete the newest cache files until it match your selected cache folder size limit.
fr_fr: Maintenir la taille limite du dossier cache en dessous d’une limite. Une fois par heure, WordPress vérifiera si votre dossier de cache dépasse la taille limite et effacera les fichiers les plus récents jusqu’à atteindre la taille limite sélectionnée.

source: Keep automatically cache size below a limit
fr_fr: Maintenir automatiquement la taille du cache en dessous d’une limite

source: Known issue: Lumière offers widgets for both old and modern type of widgets. Old widgets (aka Legacy Widgets) are available if you installed a Classic Widget plugin or any plugin that simplified the way to display your widgets and posts, or if your WordPress install is prior to WordPress 5.8. Modern Widgets (aka Block Widgets) are standard in every new WordPress install as of 5.8. Potential issues could arise should you install both types of Lumière widgets, namely Legacy and Block Widgets. In order to prevent such issues, make sure that both Block and Legacy Widgets are not activated together. Remove any Lumière Block Widget previously added if you use Lumière Legacy Widget when using the pre-5.8/Classic Editor. In the pre-5.8/Classic Widget Editor, no option to add a Block Widget is available, but you may find a Block based Widget previously added in Block Editor, which you need to remove.
fr_fr: Problème connu : Lumière propose des widgets pour les types de widgets anciens et modernes. Les anciens widgets (alias Legacy Widgets) sont disponibles si vous avez installé l’extension Classic Widget ou toute extension simplifiant la façon d’afficher vos widgets et articles, ou si votre installation WordPress est antérieure à WordPress 5.8. Les widgets modernes (alias Block Widgets) sont standard dans chaque nouvelle installation de WordPress à partir de la version 5.8. Des problèmes potentiels peuvent survenir si vous installez les deux types de widgets Lumière, à savoir Legacy et Block Widget. Afin d’éviter de tels problèmes, assurez-vous que les widgets Block et Legacy ne sont pas activés ensemble. Supprimez tout widget Lumière Block précédemment ajouté si vous utilisez Lumière Legacy Widget lors de l’utilisation de l’éditeur pré-5.8/Classic. Dans l’éditeur de widgets pré-5.8/Classic, aucun réglage pour ajouter un widget de bloc n’est disponible, mais vous pouvez trouver un widget basé sur des blocs précédemment ajouté dans l’éditeur de blocs, que vous devez supprimer.

source: Notice: in order to have this feature work, you must add a widget using %1$sWidget Page%2$s option. Take a look at the "Widget" section of this "how to" page.
fr_fr: Remarque : pour que cette fonctionnalité fonctionne, vous devez ajouter un widget à l’aide du paramètre %1$sWidget Page%2$s. Jetez un oeil à la section « Widget » de cette page d’aide.

source: How to use auto-widget?
fr_fr: Comment utiliser l’auto-widget ?

source: Should you have hundreds of posts named after movie's title and you don't want to edit them all, manually inserting widgets or a Lumière blocks inside the post, Lumière does everything for you.
fr_fr: Si vous avez des centaines d’articles nommées selon le titre du film, et que vous ne souhaitez pas toutes les éditer pour insérer manuellement des widgets ou des blocs Lumière à l’intérieur de l’article, Lumière fait tout à votre place.

source: When should you use auto-widget?
fr_fr: Quand devrait-on utiliser l’auto-widget ?

source: It is a special type of widget. Unlike the normal Lumière widget (see widget help section in this page), Lumière auto-widget does not require you to enter any IMDb ID or movie's title manually. It automatically query the IMDb according to title you gave to your post. Beware it does so for all posts you have published.
fr_fr: C’est un type spécial de widget. Contrairement au widget normal de Lumière (voir la section d’aide du widget sur cette page), ce widget automatique ne vous oblige pas à saisir manuellement un identifiant IMDb ou un titre de film. Il interroge automatiquement l’IMDb en fonction du titre que vous avez donné à votre article. Attention, il le fait pour toutes les articles que vous avez publié.

source: What is Lumière auto-widget?
fr_fr: Qu’est-ce que Lumière! auto-widget ?

source: Lumière is incompatible with the following plugins:
fr_fr: Lumière est incompatible avec les extensions suivantes :

source: Maximum number of results reached. You can increase this limit in the admin options.
fr_fr: Nombre maximum de résultats atteint. Vous pouvez augmenter ce nombre dans les options d’administration.

source: No IMDb result found for
fr_fr: Pas de résultat IMDb trouvé pour

source: Settings
fr_fr: Réglages

source: Auto title widget?
fr_fr: Widget de titre automatique ?

source: If cache is deactived, pictures will not be displayed and it will take longer to display the page.
fr_fr: Si le cache est désactivé, les images ne seront plus disponibles et l’affichage des pages sera plus long.

source: No Links
fr_fr: Pas de liens

source: out of 10
fr_fr: sur 10

source: No post found with this taxonomy.
fr_fr: Aucun article trouvé pour cette taxonomie.

source: internal link
fr_fr: lien interne

source: Lumière! Movies widget
fr_fr: Widget Lumière Movies

source: Sponsor
fr_fr: Soutien

source: Any modification of the stylesheet you make should be done in your template folder rather than by editing lumiere-movies/css/lumiere.css. Download %1$sunminified css%2$s from the GIT repository, and edit that very file so it suits your needs. Then copy the edited file into you template folder: that file will superseed the plugin's one. Whenever you will update, your template's file will remain untouched and your edits will make it. Just make sure you are using a child theme, otherwise your customised lumiere.css will be deleted at the next template update.
fr_fr: Toute modification de la feuille de style que vous effectuez doit être faite dans votre dossier modèle plutôt qu’en éditant lumiere-movies/css/lumiere.css. Téléchargez-le %1$scss décompressé%2$s depuis le dépôt GIT, et éditez ce fichier pour qu’il corresponde à vos besoins. Copiez ensuite le fichier édité dans le dossier de votre modèle : ce fichier va se superposer à celui de l’extension. A chaque mise à jour, le fichier de votre modèle restera intact et vos modifications seront prises en compte. Assurez-vous simplement que vous utilisez un thème enfant, sinon votre lumiere.css personnalisé sera supprimé lors de la prochaine mise à jour du modèle.

source: (Activated automatically for "genre" and "director" taxonomies upon installation)
fr_fr: (Activé automatiquement pour les taxonomies « genre » et « réalisateur » lors de l’installation)

source: Filter language
fr_fr: Filtrer la langue

source: All
fr_fr: Tous

source: Add a Lumières!'s %1$s widget %2$s to your sidebar, and go to "Main Options / Advanced" and check "Auto title widget" option.
fr_fr: Ajoutez un %1$s widget %2$s Lumières! à votre colonne latérale, puis allez dans « Options principales / Avancé » et cochez l’option « Auto titre widget ».

source: Warning! This URL cannot be identical to popup's URL above.
fr_fr: Attention ! Cette URL ne peut être identique à l’URL de fenêtre contextuelle ci-dessus.

source: The URL that will be displayed for the taxonomy's pages.
fr_fr: L’URL qui sera affichée pour les pages de taxonomie.

source: Keep settings upon uninstall
fr_fr: Sauvegarder la configuration lors de la désinstallation

source: Weither to display a thumbnail or a larger poster for movies included in posts, widgets, popups and taxonomy pages. Untick the box to open a new option and choose a different poster width.
fr_fr: Soit afficher la miniature ou l’image agrandie de pochette pour les films dans les articles, les widgets, les fenêtres contextuelles, les pages de taxonomie. Désélectionnez la boîte pour afficher une nouvelle option et choisir la largeur de la pochette.

source: Template %s up-to-date
fr_fr: Modèle %s à jour

source: Display IMDb website source of the movie
fr_fr: Afficher le site de la source IMDb du film

source: runtime
fr_fr: durée

source: Delete selected files
fr_fr: Effacer les fichiers sélectionnés

source: Delete selected cache files?
fr_fr: Effacer les fichiers de cache sélectionnés ?

source: language
fr_fr: langue

source: keyword
fr_fr: mot-clé

source: country
fr_fr: pays

source: color
fr_fr: couleur

source: writer
fr_fr: scénariste

source: director
fr_fr: réalisateur

source: composer
fr_fr: compositeur

source: 3. It is possible to limit the number of results in the queries using its dedicated option. The less results there is, the less server resources are required and the faster the output is displayed. This limit number applies to the search of movies with a similar name (menu option in movies popups) and in %1$sthe admin tool of queries to find IMDb id%2$s.
fr_fr: 3. Il est possible de limiter le nombre de résultats dans les requêtes grâce à son paramètre dédié. Moins il y a de résultats, moins de ressources serveur sont nécessaires et plus les informations s’affichent rapidement. Ce nombre limitatif s’applique à la recherche de films avec un nom similaire (paramètre de menu dans les fenêtres contextuelles de films) ainsi que dans %1$sl’outil d’administration de recherches pour trouver un identifiant IMDb%2$s.

source: 2. Search category allows to modify the type of material your searching. If your blog is about series only, select in the dropdown list 'series only'. If it is about videogames, select the option accordingly.
fr_fr: 2. La recherche par catégorie permet de modifier le type d’information recherchée. Si votre blog ne traite que de séries, sélectionnez dans la liste déroulante « séries uniquement ». S’il s’agit de jeux vidéo, sélectionnez l’option correspondante.

source: Lumière queries the IMDb for every movie or person you are looking for. You can modify the results from the IMDb displayed in your blog will tweaking the search options available in menu options 'Main / Advanced'.
fr_fr: Lumière interroge l’IMDb pour chaque film ou personne que vous recherchez. Vous pouvez modifier les résultats de l’IMDb affiché dans votre blog en peaufinant les réglages de recherche disponibles dans les options de menu « Principal - Avancé ».

source: Changing default IMDb search options
fr_fr: Modification des options de recherche IMDb par défaut

source: Click on 'copy template', that's it! You will be notified when a new template is available. You can customize even further the template that was copied into your template to match your specific needs. By default, the new taxonomy template will show you the person/item and the posts and pages mentioning them.
fr_fr: Cliquez sur « copier le modèle », c’est tout ! Un avertissement vous sera donné lorsqu’un nouveau modèle sera disponible. Vous pouvez personnaliser encore plus le modèle qui a été copié dans votre modèle pour répondre à vos besoins spécifiques. Par défaut, le nouveau modèle de taxonomie vous montrera la personne/l’élément et les articles qui le mentionnent.

source: To fully enjoy this taxonomy, make sure you copied the template files located in the Lumière! movies folder 'lumiere-movies/theme/' into your 'theme' folder. This can be automatized by using the options available in Lumière! taxonomy :
fr_fr: Pour profiter pleinement de la taxonomie, assurez-vous de copier les fichiers modèles situés dans le dossier « lumiere-movies/theme/ » de Lumière! dans votre propre dossier « thème ». Cela peut être automatisé en utilisant les réglages disponibles dans la taxonomie de Lumière! :

source: Advanced: Customize your theme for your taxonomy pages
fr_fr: Avancé : Personnalisez votre thème pour vos pages de taxonomie

source: Once you have published your first article including a movie (both widget and inside a post trigger that function) WordPress will display the new taxonomy under 'posts' admin section. Depending on the movie details you have selected, you will find them in the menu.
fr_fr: Une fois que vous avez publié votre premier article comprenant un film (à la fois un widget et à l’intérieur d’un article qui active cette fonction), WordPress affichera la nouvelle taxonomie sous le menu « Article ». Selon les détails du film que vous avez sélectionné, vous les trouverez dans le menu.

source: How to use taxonomy in WordPress?
fr_fr: Comment utiliser la taxonomie dans WordPress ?

source: Since WordPress 2.3, WordPress users can use taxonomy.
fr_fr: Depuis WordPress 2.3, les utilisateurs de WordPress peuvent utiliser la taxonomie.

source: Are you tired of losing your carefully hand-made CSS edits at every Lumière! update? There is a solution.
fr_fr: En avez vous assez de perdre vos modifications CSS soigneusement faites à la main à chaque mise à jour de Lumière ? Il existe une solution.

source: How to ensure that my css edits remain through plugin updates?
fr_fr: Comment s’assurer que mes modifications CSS sont conservées lors des mises à jour de l’extension ?

source: Then the PHP code:
fr_fr: Ensuite le code PHP :

source: How to add a search function for movies in my page? (advanced users)
fr_fr: Comment ajouter une fonction de recherche de films sur ma page ? (utilisateurs avancés)

source: It could happen you do not want popups at all. Since by default Lumière Movies adds links whenever relevant to movie's details inside your article, you may change that behaviour. In order to do so, look for 'Main options / Advanced / Remove popup links' and uncheck the box. No links will be displayed, both for the widget and within your articles.
fr_fr: Il se peut que vous ne souhaitiez pas du tout de fenêtres surgissantes. Puisque Lumière Movies ajoute par défaut des liens vers les détails du film dans votre publication, vous pouvez souhaiter modifier ce comportement. Pour ce faire, cherchez « Options principales /Avancé/Retirer les liens fenêtres surgissantes » et décochez la case correspondante. Plus aucun lien ne sera affiché, aussi bien pour le widget que dans vos publications.

source: I want to get rid of thoses links opening popups
fr_fr: Je veux me débarrasser de ces liens ouvrant des fenêtres surgissantes

source: How to display data inside my post - advanced users
fr_fr: Comment afficher les données dans mon article - utilisateurs avancés

source: You can add as many blocks as you whish; there is no limitation in the number of movies you can display per article.
fr_fr: Vous pouvez ajouter autant de blocs que vous le souhaitez ; il n’y a aucune limitation au nombre de films que vous pouvez afficher par publication.

source: Lumiere Movies Inside a post using gutenberg block
fr_fr: Lumière! Movies dans un article utilisant un bloc Gutenberg

source: Lumière provides you with tools to add 'HTML tags' (span) to wrapp your movie's title when writting your article. These 'HTML tags' will be then converted into movie's details. In the same way as for for popups, three tools are provided depending upon your the WordPress interface you used to publish your posts. If you use the modern WordPress interface, a Lumière block is provided; just enter the movie's title or IMDb id, and you are done!
fr_fr: Lumière met à votre disposition des outils pour ajouter des « balises HTML » (span) pour envelopper le titre de votre film lors de la rédaction de votre article. Ces « balises HTML » seront ensuite converties en détails de film. De la même manière que pour les fenêtres surgissantes, trois outils sont fournis en fonction de l’interface WordPress que vous utilisez pour sauvegarder vos articles. Si vous utilisez l’interface moderne de WordPress, un bloc Lumière est fourni ; il suffit d’entrer le titre du film ou l’identifiant IMDb, et le tour est joué !

source: Including movie information within your article is quite useful; it can ingeniously illustrate your post, displays crucial data (directors, actors) and at the same time add links to further popups that include even more detailed information.
fr_fr: Inclure des informations sur les films dans votre article est très utile ; cela peut illustrer ingénieusement votre article, afficher des données cruciales (réalisateurs, acteurs) et en même temps ajouter des liens vers d’autres fenêtres contextuelles qui contiennent des informations encore plus détaillées.
