Repository: jcvignoli/lumiere-movies
Catalog: src/languages/lumiere-movies-*.po
Languages: fr_fr

source: Using the movie's IMDb id allows more security: instead of searching for a title, Lumiere Movies can display directly the movie you are looking for. Very useful when your movie's name does not work as it should, due to movies with the same title, if a incorrect movie is displayed, etc.
fr_fr: L’utilisation de l’identifiant IMDb du film permet plus de sécurité : au lieu de rechercher un titre, Lumière Movies peut afficher directement le film que vous recherchez. Très utile lorsque le nom de votre film ne fonctionne pas comme il le devrait, en raison de films avec le même titre, si un film incorrect est affiché, etc.

source: Lumiere Movies query interface
fr_fr: Interface de requête de films Lumière

source: As in many other sections of Lumière plugin, you can add the movie's IMDb id instead of the movie's title to make sure that the right movie is display. Should you want to find the movie's IMDb id, click on 'use this tool' and a new windows will be displayed; search for your movie, copy-paste its IMDb id into the sidebar, and select by 'movie id' in the dropdown list.
fr_fr: Comme dans de nombreuses autres sections de l’extension Lumière, vous pouvez ajouter l’identifiant IMDb du film au lieu du titre du film pour vous assurer que le bon film est affiché. Si vous voulez trouver l’identifiant IMDb du film, cliquez sur « utiliser cet outil » et une nouvelle fenêtre s’affichera ; recherchez votre film, copiez-collez son identifiant IMDb dans la barre latérale et sélectionnez par « ID de film » dans la liste déroulante.

source: Lumière metabox to add a movie in a widget
fr_fr: Metabox Lumière pour ajouter un film dans un widget

source: <strong>Second</strong>, edit your post and add the name of the movie in the box to the sidebar on your right-hand. Lumiere Movies will automatically display in the widget the movie selected.
fr_fr: <strong>Deuxièmement</strong>, modifiez votre article et ajoutez le nom du film dans la case de la barre latérale sur votre droite. Lumière Films affichera automatiquement le film sélectionné dans le widget.

source: %3$sFirst%4$s, prior to WordPress 5.8, go to %5$swidget%6$s administration (%1$sappearance%2$s tab), drag %1$sLumière widget%2$s (from %1$sinactive widgets%2$s) to a sidebar, and modify the box's title (in case you don't want to have the default name). As of WordPress 5.8, widgets are blocks selected by the user, and adding them is very intuitive.
fr_fr: %3$sTout d’abord%4$s, avant WordPress 5.8, accédez à l’administration du %5$swidget%6$s (onglet %1$sapparence%2$s), faites glisser le %1$swidget Lumière%2$s (à partir des %1$swidgets inactifs%2$s) vers une colonne latérale et modifiez le titre de la boîte (au cas où vous ne voudriez pas que la boîte n’ait le nom par défaut). Depuis WordPress 5.8, les widgets sont des blocs sélectionnés par l’utilisateur/utilisatrice, mais le processus est identique, et les ajouter est très facile.

source: How to use the widget
fr_fr: Comment utiliser le widget

source: Widgets are widely used in WordPress. It allows to select which information display in a given area, usually in the sidebar. Lumière allows to display any movie into your sidebar.
fr_fr: Les widgets sont largement utilisés dans WordPress. Il permet de sélectionner facilement les informations à afficher dans une zone, généralement sur la barre latérale. Lumière permet d’afficher n’importe quel film dans votre barre latérale.

source: Whatever the tool you prefer, when you add such a link a small icon confirming that the link is Lumière compliant is added to your movie's title.
fr_fr: Quel que soit l’outil que vous préférez, lorsque vous ajoutez un tel lien, une petite icône confirmant que le lien est compatible avec Lumière est ajoutée au titre de votre film.

source: No explanation is need for those who prefer to write directly in HTML editor; it goes without saying they know how to add an HTML tag. But even in that interface a button is available for adding the code. For references, here is the HTML tag to wrap your movie's title with:
fr_fr: Aucune explication n’est nécessaire pour celles et ceux qui préfèrent écrire directement dans l’éditeur HTML ; il va sans dire que ces personnes savent comment ajouter une balise HTML. Mais même dans cette interface, un bouton est disponible pour ajouter le code. Pour information, voici la balise HTML avec laquelle envelopper le titre de votre film :

source: If you use an old WordPress version or a recent WordPress with the plugin 'classic editor' installed, you can access in the dedicated menu to 'add a popup link:
fr_fr: Si vous utilisez une ancienne version de WordPress ou un WordPress récent avec l’extension « Classic Editor » installée, vous pouvez accéder dans le menu dédié à « ajouter un lien de fenêtre contextuelle » :

source: If you use a recent WordPress and have not activated a plugin to continue using the old editor interface, you can add a Lumière link to a popup by selecting the title of your movie, then adding the link with the dedicated contextual menu option:
fr_fr: Si vous utilisez un WordPress récent et n’avez pas activé d’extension pour continuer à utiliser l’ancienne interface de l’éditeur, vous pouvez ajouter un lien Lumière! dans une fenêtre modale en sélectionnant le titre de votre film, puis en ajoutant le lien avec le réglage de menu contextuel dédié :

source: To create a link to a popup window, you only need to put the %1$smovie's title%2$s inside dedicated tags. Depending on the visual interface you use (modern WordPress, wysiwig old WordPress, or pure text interface), you may add these tags in different ways.
fr_fr: Pour créer un lien vers une fenêtre contextuelle, il vous suffit de mettre le %1$stitre du film%2$s dans des balises dédiées. Selon l’interface visuelle que vous utilisez (WordPress moderne, ancien WordPress WYSIWYG ou interface de texte pur), vous pouvez ajouter ces balises de différentes manières.

source: How to make a popup link
fr_fr: Comment faire un lien de fenêtre surgissante

source: Popup is a window that opened on click, which allows to consult director's and movie's information; if browsing a movie, one can read more about the movie but also the people who took part in the movie, such as actors, directors, etc.
fr_fr: « Popup » est une fenêtre contextuelle qui s’ouvre au clic, qui permet de consulter les informations du réalisateur et du film ; en parcourant un film, on peut en savoir plus sur le film mais aussi sur les personnes qui ont participé au film, comme les acteurs, les réalisateurs, etc.

source: The first way to use Lumiere Movies is to add links to movie titles that opens popups with information about that very same movies. It is a usefull for posts that mention movies title; just add a link to your movie title, and let visitors knowing more about the details of the movie you mention.
fr_fr: La première façon d’utiliser Lumière Movies est d’ajouter des liens vers des titres de films qui ouvrent des fenêtres surgissantes avec des informations sur ces mêmes films. C’est très utile pour les articles qui mentionnent des titres de films ; il suffit d’ajouter un lien vers le titre de votre film, et de permettre aux visiteurs d’en savoir plus sur les détails du film que vous mentionnez.

source: Lumiere Movies is a plugin under intense development; this help section might be innacurate with regard to the latest functions. Main functions of the plugin are explained below, aiming to be as much user-friendly as possible.
fr_fr: Lumière! est une extension en cours de développement intense ; cette section d’aide peut être inexacte en ce qui concerne les dernières fonctions. Les principales fonctions de l’extension sont expliquées ci-dessous, dans le but d’être aussi conviviales que possible.

source: This section covers the three main ways to display movie data and some related options in Lumière.
fr_fr: Cette section couvre les trois principales manières d’afficher les données d’un film et certains réglages associés dans Lumière.

source: Enter the maximum number of %s you want to display
fr_fr: Entrez le nombre maximum de %s que vous souhaitez afficher

source: Display the main poster
fr_fr: Afficher l’affiche principale

source: year of release
fr_fr: année de sortie

source: rating
fr_fr: notation

source: production company
fr_fr: compagnie de production

source: trailer
fr_fr: bande annonce

source: tagline
fr_fr: slogan

source: soundtrack
fr_fr: bande son

source: quote
fr_fr: citation

source: producer
fr_fr: producteur

source: plot
fr_fr: intrigue

source: goof
fr_fr: gaffe

source: also known as
fr_fr: aussi connu sous

source: actor
fr_fr: acteur

source: Get support and support plugin development
fr_fr: Obtenir de l’aide et fournir de l’aide pour le développement de l’extension

source: Main and advanced options
fr_fr: Options principales et avancées

source: In the role of
fr_fr: Dans le rôle de

source: Edit the following values with caution. It can have unattended effects on your WordPress installation.
fr_fr: Modifiez avec précaution les valeurs suivantes. Cela peut avoir un effet inattendu sur votre installation WordPress.

source: WordPress default debug log
fr_fr: Journal de débogage de WordPress par défaut

source: Path
fr_fr: Chemin

source: Save logs
fr_fr: Sauvegarder les journaux

source: Show the debug log on screen (for administrators only).
fr_fr: Afficher le journal de débogage à l’écran (seulement pour les admins).

source: Display debug on screen
fr_fr: Afficher le débogage à l’écran

source: From lowest to highest verbosity level.
fr_fr: Du plus bas au plus haut niveau de verbosité.

source: Debug verbosity
fr_fr: Verbosité du débogage

source: [Extra debugging options]
fr_fr: [Options additionnelles de débogage]

source: Use integrated debugging functions.
fr_fr: Utiliser les fonctions intégrées de debug.

source: No directors found.
fr_fr: Aucun réalisateur trouvé.

source: Matching title
fr_fr: Titre correspondant

source: Similar Titles
fr_fr: Titres similaires

source: Search for other movies with the same title
fr_fr: Rechercher d’autres films avec le même titre

source: Display (a number of) alternative movie names and in other languages
fr_fr: Afficher (un nombre de) titres de films alternatifs et en d’autres langues

source: What type to use for the search, such as movies, series (for TV Shows), and videogames.
fr_fr: Quel genre chercher, tel que films, séries (pour séries télé), et jeux vidéo.

source: Video games only
fr_fr: Jeux vidéo uniquement

source: Series only
fr_fr: Séries uniquement

source: Movies only
fr_fr: Films uniquement

source: Movies and series
fr_fr: Films et séries

source: Search categories
fr_fr: Catégories de recherche

source: Add automatically a widget according to your post title. If regular widgets have been added to post too, the auto title widget will be displayed before them. Usefull if blog a lot about movies; if a query does not bring any result with the post title, nothing is displayed.
fr_fr: Ajoute automatiquement un widget selon le titre de l’article. Si un widget a aussi été ajouté à l’article, le widget titre automatique sera affiché avant ce derniers. Utile si votre blog est dédié au cinéma ; si une recherche ne retourne aucun résultat selon le titre de votre article, rien n’est affiché.

source: If activated, Lumière options are displayed in a top menu. Not recommended if you have many plugins occupying that area already.
fr_fr: Si activé, les options de Lumière! apparaissent dans le menu supérieur. Déconseillé si vous possédez un trop grand nombre d’extensions qui occupent cette zone.

source: If enabled, Lumiere options are displayed in a dedicated menu on the left panel instead of being displayed in the settings menu.
fr_fr: Si activé, les options Lumière sont affichées dans un menu dédié sur le panneau de gauche, au lieu d’être affichées dans le menu de réglages généraux.

source: Plain pages
fr_fr: Pages pleines

source: Taxonomy for
fr_fr: Taxonomie pour

source: Inside the post/widget/taxonomy color theme
fr_fr: Thème dans les articles/widget/taxonomie

source: printed publicity
fr_fr: publicité imprimée

source: see all
fr_fr: voir tout

source: Full biography
fr_fr: Biographie complète

source: Full filmography
fr_fr: Filmographie complète

source: click to show more %1s
fr_fr: cliquez pour plus de %1s

source: Plots
fr_fr: Intrigues

source: Summary
fr_fr: Résumé

source: Display release year. The release year will appear next to the movie title into brackets
fr_fr: Affiche l’année de sortie. L’année de sortie apparaîtra à côté du titre du film, entre parenthèses

source: Data Management
fr_fr: Gestion des données

source: white
fr_fr: blanc

source: grey (default)
fr_fr: gris (d&eacute;faut)

source: Find similar taxonomy results
fr_fr: Trouver des résultats de taxonomie similaires

source: Lumiere Query Interface %1s
fr_fr: Lumière Interface de recherche %1s

source: Use the checkbox to display the taxonomy tags. When activated, selected taxonomy will become blue if it is activated in the 'display' section and will turn red otherwise.
fr_fr: Utilisez la case à cocher pour afficher les étiquettes de taxonomie. Lorsque activé, la taxonomie sélectionné deviendra bleu si elle a été activée dans la section "Afficher" ou deviendra rouge dans le cas contraire.

source: The full URL utilized for the director taxonomy page will be:
fr_fr: L’URL complète utilisée pour la page de taxonomie de réalisateur sera :

source: URL for the taxonomy pages
fr_fr: L’URL pour les pages de taxonomie

source: Example: the full URL utilized for the people's popup will be:
fr_fr: Exemple : l’URL complète utilisée pour les fenêtres contextuelles des personnes sera :

source: Example: the full URL utilized for the movies' popups will be:
fr_fr: Exemple : l’URL complète utilisée pour les fenêtres contextuelles des films sera :

source: Taxonomy terms are uninstalled when removing the plugin if you selected not to keep the settings upon uninstall.
fr_fr: Les termes de taxonomie sont désinstallés lorsque l’extension est désinstallée si vous avez sélectionné de ne pas sauvegarder la configuration lors de la désinstallation.

source: This will add taxonomy terms found for the movie when display a page with a widget or a into a post. Taxonomy allows to group posts by a series of chosen terms, as explained in
fr_fr: Ceci ajoutera les termes de taxonomie trouvés pour le film lorsqu’une page est affichée avec un widget ou dans un article. La taxonomie permet de regrouper les articles en série de termes choisis, comme expliqué dans

source: Use taxonomy
fr_fr: Utiliser la taxonomie

source: lightgrey
fr_fr: gris léger

source: Wrong values. You can not select the same URL string for taxonomy pages and popups.
fr_fr: Mauvaises valeurs. Vous ne pouvez pas sélectionner le même morceau d’URL pour les pages de taxonomie et les fenêtres contextuelles.

source: Widget title:
fr_fr: Titre du widget :

source: Cover picture
fr_fr: Photo de couverture

source: Popup color theme
fr_fr: Thème de couleur pour la fenêtre surgissante

source: black
fr_fr: noir

source: white (default)
fr_fr: blanc (défaut)

source: Theme color
fr_fr: Thème Lumière

source: Current:
fr_fr: Actuel :

source: Photo path (relative to the cache path)
fr_fr: Chemin de photo (relatif au chemin du cache)

source: You are not allowed to call this page directly.
fr_fr: Vous n’êtes pas autorisé à afficher cette page directement.

source: Informations about %1s
fr_fr: Information pour %1s

source: admin options
fr_fr: réglages d’administration

source: URL for the popups
fr_fr: L’URL pour les fenêtres contextuelles

source: Debug Lumière!
fr_fr: Débogage de Lumière!

source: Lumière! query cache is empty.
fr_fr: Le cache de requête de Lumière! est vide.

source: Delete query cache
fr_fr: Effacer le cache de requête

source: Delete query cache?
fr_fr: Effacer le cache de requête ?

source: If you want to reset the query cache (every search creates a cache file) click on the button below.
fr_fr: Si vous voulez réinitialiser le cache de recherche entier (chaque recherche crée un fichier de cache), cliquez sur le bouton ci-dessous.

source: Total query cache size:
fr_fr: Taille totale du cache de requête :

source: Query cache files deleted.
fr_fr: Fichiers de cache de recherche ont &eacute;t&eacute; effac&eacute;s.

source: Click on "reset settings" to refresh the values.
fr_fr: Cliquez sur « réinitialiser les réglages » pour rafraîchir les valeurs.

source: Apparently, you have no cache folder.
fr_fr: Visiblement, vous n’avez pas de dossier de cache.

source: A cache folder has to be created and the cache storage option has to be activated before you can manage the cache.
fr_fr: Un dossier de cache doit exister et le paramètre d’enregistrement de cache doit être activée avant de pouvoir gérer le cache.

source: No people's cache found.
fr_fr: Pas de cache de personnes trouvé.

source: You may also select a group of movies to delete.
fr_fr: Vous pouvez également sélectionner un groupe de film à effacer.

source: If you want to refresh movie's cache regardless the cache expiration time, you may either tick movie's checkbox(es) related to the movie you want to delete and click on "delete cache". You can also click on "refresh" to update a movie series of details.
fr_fr: Si vous souhaitez rafraîchir le cache d’un film sans tenir compte du délai d’expiration du cache, vous pouvez soit cocher la ou les cases relatives au film que vous souhaitez supprimer et cliquer sur « supprimer le cache ». Vous pouvez également cliquer sur « rafraîchir » pour mettre à jour une série de détails de films.

source: No movie's cache found.
fr_fr: Pas de cache de film trouvé.

source: Lumière! cache is empty.
fr_fr: Le cache de Lumière! est vide.

source: If you want to reset the entire cache (this includes queries, names, and pictures) click on the button below.
fr_fr: Si vous voulez réinitialiser le cache entier (cela inclut les caches des recherches, des noms et des images), cliquez sur le bouton ci-dessous.

source: %s file
fr_fr: %s fichier

source: Global cache management
fr_fr: Gestion du cache général

source: Simplified cache data
fr_fr: Données simplifiées de cache

source: Cache is crucial for Lumière! operations. Initial IMDb queries are quite time consuming, so if you do not want to kill your server and look for a smooth experience for your users, do not delete often your cache.
fr_fr: Le cache est crucial pour le fonctionnement de Lumière! Comme les premières recherches sont très coûteuses en terme de ressources, pour éviter de monopoliser le serveur et permettre aux gens de naviguer rapidement sur le site, utilisez le cache.

source: All cache files deleted.
fr_fr: Tous les fichiers de cache ont été effacés.

source: No cache folder found.
fr_fr: Pas de dossier de cache trouvé.

source: Search
fr_fr: Recherche

source: IMDb ID:
fr_fr: Identification IMDb :

source: IMDb Identification number
fr_fr: Numéro d’identification IMDB

source: Results related to your query:
fr_fr: Résultats correspondants à votre requête :

source: Remove all links?
fr_fr: Enlever tous les liens ?

source: Move selected movie detail:
fr_fr: Déplacer le détail de film sélectionné :

source: You can select the order for the information selected in "display" section. Select first the movie detail you want to move, use "up" or "down" to reorder Lumiere Movies display. Once you are happy with the new order, click on "update settings" to keep it.
fr_fr: Vous pouvez choisir l’ordre des informations sélectionnées dans la section « affichage ». Sélectionnez d’abord le détail du film que vous souhaitez déplacer, utilisez « haut » ou « bas » pour réorganiser l’affichage de Lumière Movies. Une fois que vous êtes satisfait du nouvel ordre, cliquez sur « mettre à jour les paramètres » pour le conserver.

source: Position of data
fr_fr: Ordre des donn&eacute;es

source: Copy template
fr_fr: Copier le modèle

source: Note: once activated, each taxonomy category will show a new option to copy a taxonomy template directy into your theme folder.
fr_fr: Remarque : une fois activée, chaque catégorie de taxonomie montrera une nouvelle option pour copier un modèle de taxonomie directement dans votre dossier de modèles.

source: Cautiously select the categories you want to display: it may have some unwanted effects, in particular if you display many movies in the same post at once. When selecting one of the following taxonomy options, it will supersede any other function or link created; for instance, you will not have access anymore to the popups for directors, if directors taxonomy is chosen. Taxonomy will always prevail over other Lumiere functionalities.
fr_fr: Sélectionnez avec soin les catégories que vous souhaitez afficher : cela peut avoir des effets indésirables, en particulier si vous affichez simultanément de nombreux films dans le même article. Lorsque vous sélectionnez l’une des options de taxonomie suivantes, elle supplantera toute autre fonction ou lien créé ; par exemple, vous n’aurez plus accès aux fenêtres surgissantes pour les réalisateurs, si la taxonomie des réalisateurs est choisie. La taxonomie prévaudra toujours sur les autres fonctionnalités de Lumière!

source: Select details to use as taxonomy
fr_fr: Sélectionnez les détails à utiliser en tant que taxonomie

source: Display languages
fr_fr: Afficher les langues

source: Display rating
fr_fr: Afficher la notation

source: Display official websites
fr_fr: Afficher les sites web officiels

source: Display composer
fr_fr: Afficher les compositeurs

source: Display colors
fr_fr: Afficher les couleurs

source: Display the production companies
fr_fr: Afficher les compagnies de production

source: Display keywords
fr_fr: Affichage des mot-cl&eacute;s

source: Display writers
fr_fr: Afficher les sc&eacute;naristes

source: Display genre
fr_fr: Afficher le genre

source: Display country
fr_fr: Afficher le pays

source: Display directors
fr_fr: Afficher les réalisateurs

source: Display the runtime
fr_fr: Afficher la durée

source: Display the title
fr_fr: Afficher le titre

source: title
fr_fr: titre

source: Taxonomy unactivated
fr_fr: Taxonomie désactivée

source: Next time you will look at your post, you will find the widget according to your post’s title.
fr_fr: La prochaine fois que vous visiterez votre article, vous trouverez un widget lié au titre l’article.

source: New option in 'Posts' menu
fr_fr: Nouvelle option dans le menu « articles »

source: What is WordPress' taxonomy?
fr_fr: Qu’est-ce que la taxonomie de WordPress ?

source: It perfectly fits in your sidebar, for example.
fr_fr: Il s’intègre parfaitement dans votre colonne latérale, par exemple.

source: How to display data inside my post
fr_fr: Comment afficher les données dans mon article

source: key and value for custom fields
fr_fr: nom et valeur des champs personnalisés

source: click to get a larger picture
fr_fr: cliquer pour obtenir une plus grande image

source: Credits:
fr_fr: Crédits :

source: do a trackback, make some noise about this plugin!
fr_fr: faire un rétrolien, faire du bruit au sujet de cette extension !

source: website
fr_fr: site web

source: Report at the development
fr_fr: Notifiez le développement

source: help me to improve the plugin.
fr_fr: aidez-moi &agrave; am&eacute;liorer le plugin.

source: translate the plugin into your own language.
fr_fr: traduire l’extension dans votre propre langue.

source: send as many bugfixes and propositions as you can on Lumiere Movies website.
fr_fr: envoyer autant de corrections et propositions que vous pouvez sur le site web de Lumière.

source: WordPress' website
fr_fr: Site internet de WordPress

source: vote on
fr_fr: votez sur

source: pay whatever you want on
fr_fr: payer ce que vous voulez sur
