Repository: jcvignoli/lumiere-movies
Catalog: src/languages/lumiere-movies-*.po
Languages: fr_fr

source: Person item selection
fr_fr: Sélection d’objet de personne

source: Movie items selection
fr_fr: Sélection des objets de film

source: Position of person data
fr_fr: Position des données de personne

source: Persons items to display
fr_fr: Objets de personnes à afficher

source: Movie items to use as taxonomy
fr_fr: Objet de films à utiliser comme taxonomie

source: Items order
fr_fr: Ordre des objets

source: Movie items order
fr_fr: Ordre des objets de films

source: Movies items to display
fr_fr: Objets de films à afficher

source: born in
fr_fr: né en

source: Won %1$1s awards and was nominated %2$2s times.
fr_fr: A gagné %1$1s récompenses et nominé %2$2s fois.

source: External URL %1s
fr_fr: URL externe %1s

source: Display (a number of) trademarks
fr_fr: Afficher (un nombre de) de marques de fabrique

source: Display (a number of) trivias
fr_fr: Afficher (un nombre de) d’anecdotes

source: Display (a number of) printed publicity
fr_fr: Afficher (un nombre de) publicités imprimées

source: Display (a number of) portrayal movies
fr_fr: Afficher (un nombre de) films de portrait

source: Display (a number of) biographical movies
fr_fr: Afficher (un nombre de) films biographiques

source: Display (a number of) publicity interviews
fr_fr: Afficher (un nombre de) interview publicitaires

source: Display (a number of) latests news
fr_fr: Afficher (un nombre de) dernières nouvelles

source: Display (a number of) movies that participated in (various categories)
fr_fr: Afficher (un nombre de) films dans lesquels il y a participation (plusieurs catégories)

source: Display children
fr_fr: Afficher les enfants

source: Display spouses
fr_fr: Afficher les conjoints

source: Display nicknames
fr_fr: Afficher les surnoms

source: Display date of birth
fr_fr: Afficher la date de naissance

source: Display date of death
fr_fr: Afficher la date de décès

source: Display biography
fr_fr: Afficher la biographie

source: Display photography (always activated)
fr_fr: Afficher la photographie (toujours activé)

source: Display the name (always activated)
fr_fr: Afficher le nom (toujours activé)

source: Display title (always activated)
fr_fr: Afficher le titre (toujours activé)

source: miscellaneous
fr_fr: divers

source: portrayal movies
fr_fr: films de portrait

source: biography
fr_fr: biographie

source: person
fr_fr: personne

source: movie
fr_fr: film

source: Search an IMDb ID for
fr_fr: Rechercher une identification IMDb pour

source: no IMDb ID found
fr_fr: aucune identification IMDb trouvée

source: no year found
fr_fr: aucune année trouvée

source: Items results
fr_fr: Résultats des objets

source: Open a popup to search the movie or person ID
fr_fr: Ouvrir une fenêtre contextuelle pour rechercher l’identifiant d’un film ou d’une personne

source: Title/Name or ID:
fr_fr: Titre/Nom ou identifiant :

source: Data option and taxonomy for persons
fr_fr: Options des données et de taxonomie pour personnes

source: Data person
fr_fr: Données personne

source: Data option and taxonomy for movies
fr_fr: Options des données et de taxonomie pour films

source: Data movie
fr_fr: Données film

source: Data persons
fr_fr: Données des personnes

source: Data management for persons
fr_fr: Gestion des données pour les personnes

source: Data movies
fr_fr: Données des films

source: Data management for movies
fr_fr: Gestion des données pour les films

source: Remove all links added by Lumière except those for taxonomy. This option will remove every single HTML displayed in widget and into the post. Usefull for users who are not interested in popup function, but want to keep information displayed in a widget or inside the.
fr_fr: Supprimer tous les liens ajoutés par Lumière à l’exception de ceux de taxonomie. Cette option supprimera tout le HTML affiché dans le widget et dans l’article. Utile pour les utilisateurs qui ne sont pas intéressés par la fonction fenêtre surgissante, mais qui veulent garder les informations affichées dans un widget ou dans l’article.

source: always next to title
fr_fr: toujours après le titre

source: No summary info found
fr_fr: Aucune info de résumé trouvée

source: No crew info found
fr_fr: Aucune info d’équipe trouvée

source: No actors info found
fr_fr: Aucun info d’acteur trouvée

source: Photo of %1s
fr_fr: Photo de %1s

source: actor trademark
fr_fr: marque de fabrique d’acteur

source: director trademark
fr_fr: marque de fabrique de réalisateur

source: uncategorized
fr_fr: sans catégorie

source: thanks movie
fr_fr: film de remerciement

source: costume department
fr_fr: département des costumes

source: costume supervisor
fr_fr: chef costumier

source: trademark
fr_fr: marque de fabrique

source: publicity interview
fr_fr: interview publicitaire

source: nickname
fr_fr: surnom

source: news
fr_fr: nouvelles

source: name
fr_fr: nom

source: died
fr_fr: mort

source: credit
fr_fr: crédit

source: born
fr_fr: né

source: birthname
fr_fr: nom à la naissance

source: award
fr_fr: récompense

source: Display (a number of) trivias (per category limit)
fr_fr: Afficher (un certain nombre de) d’anecdotes (par limite de catégorie)

source: Display (a number of) goofs (per category limit)
fr_fr: Afficher (un certain nombre de) gaffes (par limite de catégorie)

source: Display cinematographers
fr_fr: Afficher les directeurs de la photo

source: 4. Delay queries time is the time in seconds between two queries made to IMDb. Should you have a blog that makes a lot of requests to IMDb, this can be usefull to avoid HTTP 504 errors (too many requests) thrown by IMDb.
fr_fr: 4. Le délai des requêtes est le temps en secondes entre deux requêtes faites à l’IMDb. Si vous avez un blog qui fait beaucoup de requêtes à IMDb, cela peut être utile pour éviter les erreurs HTTP 504 (trop de requêtes) retournées par IMDb.

source: 1. Search language allows to modify the language of the query. This is generally not the language of the output: most of the details will be returned in English by the IMDb, except the title, for exemple. This options mainly changes the language of the query; it may therefore ease to find your movies on a blog that is run in a different language than English.
fr_fr: 1. La langue de recherche permet de modifier la langue de la requête. Il ne s’agit généralement pas de la langue d’affichage : la plupart des détails seront affichés en anglais par IMDb, à l’exception du titre, par exemple. Cette option modifie principalement la langue de la requête ; il peut donc être plus facile de trouver vos films sur un blog qui est géré dans une autre langue que l’anglais.

source: Four options are available: "search language", "search categories", "limit the number of results" and "delay queries time".
fr_fr: Quatre options sont disponibles : « langue de recherche », « catégories de recherche », « limiter le nombre de résultats » et « retarder les requêtes ».

source: Important: should you get a page not found error (404) when visiting the dynamically created pages, just go to %1$s Permalink Settings %2$s to refresh the rewriting rules.
fr_fr: Important : si vous recevez une erreur de page non trouvée (404) lorsque vous visitez une page créée dynamiquement, rendez-vous simplement sur la page des %1$s Options Permaliens %2$s pour rafraîchir les règles de réécriture.

source: After activating taxonomy and selecting which movie fields to use, your posts will have brand new links to page including all those details. By default, you can click on the on any director and genre on your page, it will open a new page dynamically created by Lumière.
fr_fr: Après avoir activé la taxonomie et sélectionné les champs de films à utiliser, vos articles auront de tout nouveaux liens vers des pages incluant tous ces détails. Par défaut, vous pouvez cliquer sur n’importe quel réalisateur et genre sur votre page, cela ouvrira une nouvelle page créée dynamiquement par Lumière.

source: Taxonomy is automatically generated in Lumière! and activated by default. You can however disable it by unchecking the box in 'Main options -> Advanced -> 'Use taxonomy'. A page including the movie fields to use as taxonomy (such as directors, genres, etc), are also to be found in 'Data -> Display'.
fr_fr: La taxonomie est générée automatiquement dans Lumière! et activée par défaut. Vous pouvez cependant la désactiver en décochant la case dans « Options principales -> Avancé -> Utiliser la taxonomie ». Une page comprenant les champs de films à utiliser comme taxonomie (tels que les réalisateurs, les genres, etc.), se trouve également dans « Données -> Affichage ».

source: Lumière Taxonomy is a feature adding it's own specific tags to WordPress. It adds new custom categories to WordPress, like the directors and the movie's genres that link all your similar posts together. For exemple, all your posts that includes movies with genre like "Adventure", "Terror" are detected and can be shown on a same taxonomy page.
fr_fr: La taxonomie Lumière est une fonctionnalité qui ajoute ses propres étiquettes à WordPress. Elle ajoute de nouvelles catégories personnalisées à WordPress, comme les réalisateurs et les genres de films qui relient tous vos articles similaires entre eux. Par exemple, tous vos articles qui incluent des films de genre « Aventure », « Terreur » sont détectés et peuvent être affichés sur une même page de taxonomie.

source: The first filter to use is 'lum_find_movie_id' (as you probably do not know the movie's IMDb ID). It will return an array with the movie's imdb id, that you can use in a second filter 'lum_display_movies_box':
fr_fr: Le premier filtre à utiliser est « lum_find_movie_id » (car vous ne connaissez probablement pas l’identifiant IMDb du film). Il retourne un tableau avec l’identifiant IMDB du film, que vous pourrez utiliser dans un second filtre « lum_display_movies_box » :

source: (including images)
fr_fr: (incluant les images)

source: plot hole
fr_fr: trou dans l’intrigue

source: error in geography
fr_fr: erreur géographique

source: anachronism
fr_fr: anachronisme

source: revealing mistake
fr_fr: erreur révélatrice

source: factual error
fr_fr: erreur factuelle

source: continuity
fr_fr: continuité

source: Remake of
fr_fr: Remake de

source: Followed by
fr_fr: Suivi par

source: Follows
fr_fr: Suite de

source: Featured in
fr_fr: Mentionné dans

source: related movie
fr_fr: film lié

source: No %s template found
fr_fr: Pas de modèle %s trouvé

source: Display (a number of) trailers
fr_fr: Afficher (un nombre de) bande-annonces

source: Display (a number of) taglines
fr_fr: Afficher (un nombre de) slogans

source: Display (a number of) soundtracks
fr_fr: Afficher (un nombre de) bandes sons

source: Display (a number of) quotes
fr_fr: Afficher (un nombre de) citations

source: Display (a number of) producers
fr_fr: Afficher (un nombre de) producteurs

source: Display (a number of) awards
fr_fr: Afficher (un nombre de) récompenses

source: Display (a number of) related movies
fr_fr: Afficher (un nombre de) films liés

source: Display (a number of) actors
fr_fr: Afficher (un nombre) d’acteurs

source: Started refreshing cache, this message will be updated as first batch of files has been run.
fr_fr: L’actualisation du cache a commencé, ce message sera mis à jour lorsque le premier lot de fichiers aura été exécuté.

source: Currently refreshing the cache, %1$1s remain to be refreshed. A new full refresh will start on %2$2s.
fr_fr: Actualisation en cours du cache, %1$1s restent à mettre à jour. Une nouvelle actualisation complète débutera le %2$2s.

source: No results found.
fr_fr: Aucun résultat trouvé.

source: Refresh selected files
fr_fr: Actualiser les fichiers sélectionnés

source: Ticked file(s) refreshed.
fr_fr: Fichier(s) coché(s) actualisé(s).

source: Since Lumière v.4.1, the auto-widget can be removed on a post basis. In Lumière options for your posts, you will find a checkbox to prevent auto-widget to be applied on a given post.
fr_fr: Depuis Lumière v.4.1, l’auto-widget peut être supprimé pour chaque article. Dans les options de Lumière pour vos articles, vous trouverez une case à cocher pour empêcher l’application de l’auto-widget sur un article donné.

source: Since Lumière version 4.3.2, the taxonomy templates you copied in your theme folder will be automatically updated whenever you update Lumière. Should a new template model be released, the latter will be automatically copied in you theme without you needing to manually update the template. However, should you want to change the behaviour, remove the 11th line starting with 'TemplateAutomaticUpdate' and your template will not be automatically updated. Instead, you'll be asked to update it manually when visiting Lumière administration pages.
fr_fr: Depuis la version 4.3.2 de Lumière, les modèles de taxonomie que vous avez copiés dans le dossier de votre thème seront automatiquement mis à jour à chaque mise à jour de Lumière. Si un nouveau modèle de taxonomie est publié, ce dernier sera automatiquement copié dans votre thème sans que vous ayez à le mettre à jour manuellement. Cependant, si vous souhaitez modifier ce comportement, supprimez la 11ème ligne commençant par « TemplateAutomaticUpdate » et votre modèle ne sera pas automatiquement mis à jour. Au lieu de cela, il vous sera demandé de le mettre à jour manuellement lorsque vous visiterez les pages d’administration de Lumière.

source: Main options
fr_fr: Options principales

source: Main Options
fr_fr: Options Principales

source: Taxonomy templates in your theme folder have been automatically updated.
fr_fr: Les modèles de taxonomie dans le dossier de votre thème ont été automatiquement mis à jour.

source: Lumière main page
fr_fr: Page principale Lumière

source: This button will %1$1sdelete%2$2s all files stored in the following folder:
fr_fr: Ce bouton %1$1seffacera%2$2s tous les fichiers sauvegardés dans le dossier suivant :

source: Invalid or missing nonce.
fr_fr: Nonce invalide ou manquant.

source: Lumière Query Interface %1s
fr_fr: Lumière Interface de recherche %1s

source: for Lumière plugin
fr_fr: pour l’extension Lumière

source: Compatibility
fr_fr: Compatibilité

source: Plugins Lumière is compatible with
fr_fr: L’extension Lumière est compatible avec

source: Plugin compatibility list
fr_fr: Liste de compatibilité d’extension

source: Warning again! Depending on your host and the number of taxonomies you are using, editing this URL may be extremeley resource intensive. You may need to reload the page several times.
fr_fr: Encore un avertissement ! En fonction de votre hébergeur et du nombre de taxonomies que vous utilisez, l’édition de cette URL peut être extrêmement gourmande en ressources. Vous devrez peut-être recharger la page plusieurs fois.

source: Update also taxonomy terms (may be resource intensive)
fr_fr: Mettre à jour les termes de taxonomie (peut requérir beaucoup de ressources)

source: down
fr_fr: bas

source: up
fr_fr: haut

source: month unknown
fr_fr: mois inconnu

source: day unknown
fr_fr: jour inconnu

source: Could not find any IMDb person with this query.
fr_fr: Impossible de trouve une personne IMDb avec cette requête.

source: Could not find any IMDb movie with this query.
fr_fr: Impossible de trouver un film IMDb avec cette requête.

source: Lumière Movies: This should not have happened.
fr_fr: Lumière Movies : cela n’aurait jamais dû se produire

source: role unknown
fr_fr: rôle inconnu

source: episode
fr_fr: épisode

source: Tags
fr_fr: Étiquettes

source: pic
fr_fr: photo

source: Lumière Query Interface
fr_fr: Lumière Interface de recherche

source: Nonce is invalid, no change has been made.
fr_fr: Le nonce est incorrect, aucun changement n’a été effectué.

source: Options could not be saved.
fr_fr: Les réglages n’ont pas pu être enregistrés.

source: You installed one of them.
fr_fr: Vous avez installé l’un d’entre eux.

source: New %s template version available
fr_fr: Nouvelle version du modèle %s disponible

source: Special features
fr_fr: Fonctionnalités spéciales

source: By default, Lumière deactivates %1$sIntelly Related Post plugin%2$s on posts that display Lumiere movies. You can overrides this Lumière feature and always display IRP instead, even if a movie is displayed in your post.
fr_fr: Par défaut, Lumière désactive %1$sl’extension Intelly Related Post%2$s sur les articles qui affichent des films de Lumière. Vous pouvez passer outre cette fonctionnalité de Lumière et toujours afficher l’IRP, même si un film est affiché dans votre article.

source: Always display Intelly Related Posts
fr_fr: Toujours afficher Intelly Related Posts

source: Interaction with third-party plugins
fr_fr: Interaction avec des extensions tierces

source: Automatized cache functions
fr_fr: Fonctions automatisées de cache

source: Do not show cache
fr_fr: Ne pas montrer le cache

source: child
fr_fr: enfant

source: spouse
fr_fr: conjoint

source: No misc info found
fr_fr: Aucune information diverse trouvée

source: No biography found
fr_fr: Aucune biographie trouvée

source: No filmography found
fr_fr: Aucune filmographie trouvée

source: No summary found
fr_fr: Aucun résumé trouvé

source: No data was saved.
fr_fr: Aucune donnée sauvegardée.

source: art department
fr_fr: département artistique

source: stunts
fr_fr: cascades

source: archive footage
fr_fr: images d’archives

source: self
fr_fr: lui-même

source: editor
fr_fr: éditeur

source: cinematographer
fr_fr: directeur de la photo

source: showrunner
fr_fr: directeur de série

source: assistant director
fr_fr: directeur adjoint

source: actress
fr_fr: actrice

source: Do not display any cache data in "manage cache" option page. Useful when you really have too many cache data to display.
fr_fr: Ne pas afficher les données de cache dans la page d’option « gérer le cache ». Utile lorsque vous avez vraiment trop de données de cache à afficher.

source: Displaying cache data is deactivated.
fr_fr: L’affichage des données du cache est désactivé.

source: No biography available
fr_fr: Pas de biographie disponible

source: The URL that will be displayed for the movies' and people's popups. Cannot be empty or limited to root "/".
fr_fr: L’URL qui sera affichée dans les fenêtres surgissante des films et des personnes. Elle ne peut être vide ou limitée à la racine "/".

source: Wrong value. The popup URL path must respect the specified value.
fr_fr: Valeur incorrecte. Le chemin d’accès à l’URL de la fenêtre surgissante doit respecter la valeur spécifiée.

source: Modal window type
fr_fr: Type de fenêtre modale

source: Modal windows (popups)
fr_fr: Fenêtres modales (surgissantes)

# block title
source: Open a search window
fr_fr: Ouvrir une fenêtre de recherche

# block description
source: Add a link that opens a popup with your selected movie
fr_fr: Ajouter un lien qui ouvre une fenêtre surgissante contenant le film sélectionné

# block title
source: Add a popup link
fr_fr: Ajouter un lien vers une fenêtre surgissante

source: Lumière! plugin has been updated to the latest version.
fr_fr: L’extension Lumière a été mise à jour vers la dernière version.

source: Template copy failed! Check the permissions in you theme folder.
fr_fr: La copie du modèle a échouée ! Vérifiez les permissions dans votre dossier de thème.

source: Lumière template successfully copied in your theme folder.
fr_fr: Le modèle de Lumière a été copié avec succès dans votre dossier de thème.

source: The selected cache file was refreshed.
fr_fr: Le fichier de cache a été rafraîchi.

source: The selected cache file was deleted.
fr_fr: Le fichier sélectionné a été effacé.

source: Ticked file(s) deleted.
fr_fr: Les fichiers sélectionnés ont été effacés.

source: No post written about %1$s
fr_fr: Aucun article écrit au sujet de %1$s

source: No data passed
fr_fr: Aucune donnée transmise

source: Language successfully changed.
fr_fr: Langue modifée avec succès.

source: year unknown
fr_fr: année inconnue

source: Unknown - Lumière movies
fr_fr: Inconnu - Lumière movies

source: Add automatically movie details to your pages with Lumière! Legacy version. As of WordPress 5.8, you rather should use block-based widgets.
fr_fr: Ajoutez les détails de films à vos pages avec Lumière! ancienne version. Depuis la version WordPress 5.8, vous devriez préférer le widget basés sur les blocs.

source: Do a new query
fr_fr: Lancer une nouvelle recherche

source: Deactivate %1$sauto title widget%2$s for this post
fr_fr: Désactiver le %1$swidget auto titre%2$s pour cet article

source: Extra options
fr_fr: Options supplémentaires

source: Use %1$sthe query tool%2$s to find the IMDb's ID.
fr_fr: Utilisez %1$sl’outil de recherche%2$s pour trouver l’identifiant IMDb.

source: Lumière! widget area
fr_fr: Zone du widget Lumière!

source: Please %1$supdate%2$s it.
fr_fr: Veuillez l’%1$sactualiser%2$s.

source: New taxonomy template file found: %2$s%1$s%3$s.
fr_fr: Nouveau modèle de taxonomie trouvé : %2$s%1$s%3$s.

source: Please %1$sinstall%2$s it.
fr_fr: Veuillez l’%1$sinstaller%2$s.

source: Taxonomy template is activated, but the following template is missing: %2$s%1$s%3$s.
fr_fr: La taxonomie est activée, mais le modèle suivant est manquant : %2$s%1$s%3$s.

source: No template file found
fr_fr: Aucun fichier de modèle trouvé

source: Back home
fr_fr: Revenir à l’accueil

source: Lumière Popups Access Error
fr_fr: Erreur d’accès fenêtre surgissante Lumière

source: Two ways to support %1$sLumiere Movies%2$s plugin development
fr_fr: Deux manières de soutenir le développement de l’extension %1$sLumière Movies%2$s

source: Get IMDb ids from links provided everywhere in the plugin interface. Even %1$shere%2$s.
fr_fr: Obtenir les identifiants IMDb à partir des liens fournis partout dans l’interface de l’extension. Même %1$sici%2$s.

source: Only the width value can be edited with bootstrap modal window. The value entered will be matched against these incremental steps: %1$s300%2$s (small size), %1$s500%2$s (medium size), %1$s800%2$s (large size), %1$s1140%2$s (extra large size)
fr_fr: Seule la valeur de la largeur peut être modifiée dans la fenêtre modale bootstrap. La valeur saisie sera comparée à ces étapes incrémentielles : %1$s300%2$s (petite taille), %1$s500%2$s (taille moyenne), %1$s800%2$s (grande taille), %1$s1140%2$s (très grande taille)

source: Modal windows are the popups that show the movie data when clicking on a name or movie title. "Highslide" or "Bootstrap" are advanced modal windows. "Classic" may be blocked by some browsers.
fr_fr: Les fenêtres contextuelles affichent les données de films lorsqu’on clique sur un nom ou un titre de film. « Highslide » et « Bootstrap » sont des gestionnaires avancés de fenêtres contextuelles. « Classique » peut être bloqué par certains navigateurs

source: (year unknown)
fr_fr: (année inconnue)

source: (month unknown)
fr_fr: (mois inconnu)

source: (day unknown)
fr_fr: (jour inconnu)

source: Credentials are required to edit this file:
fr_fr: Des informations d’identification sont nécessaires pour modifier ce fichier :

source: List of posts tagged
fr_fr: Liste des articles étiquettés

source: All Lumière taxonomies known:
fr_fr: Toutes les taxonomies connues :
