Repository: jcvignoli/lumiere-movies
Catalog: src/languages/lumiere-movies-*.po
Languages: fr_fr

source: You will never believe there is so many ways to thank me. Yes, you can:
fr_fr: Vous ne croirez jamais qu’il existe autant de moyens de me remercier. Effectivement, vous pouvez :

source: Support me!
fr_fr: Soutenez-moi !

source: how to
fr_fr: instructions

source: FAQs
fr_fr: FAQ

source: check the
fr_fr: consulter

source: to ask for help.
fr_fr: pour demander de l’aide.

source: visit
fr_fr: visiter

source: You will never believe there is so many ways to be supported. You can:
fr_fr: Vous ne croirez jamais qu’il existe autant de moyens d’être aidé. Vous pouvez :

source: Be supported!
fr_fr: Être aidé !

source: Support, donate & credits
fr_fr: Aide, dons et crédits

source: Changelog
fr_fr: Journal des modifications

source: What's new
fr_fr: Nouveautés

source: Frequently asked questions
fr_fr: Foire aux questions

source: How to use Lumiere Movies
fr_fr: Comment utiliser Lumière

source: Limit results
fr_fr: Limiter les résultats

source: Top menu for Lumière options
fr_fr: Menu en haut des options de Lumière

source: Left menu for Lumière options
fr_fr: Menu de gauche des options de Lumière

source: The options hereafter can break a lot of things. Edit them only if you know what you are doing.
fr_fr: Les options ci-dessous peuvent casser bien des choses. Ne les modifiez que si vous savez ce que vous faites.

source: Size of the imdb cover picture. The value will correspond to the width in pixels. Delete any value to get maximum width.
fr_fr: Taille de la pochette IMDb. La valeur indique la largeur en pixels. Effacer toute valeur pour afficher la largeur maximale.

source: Display only thumbnail
fr_fr: Afficher uniquement la miniature

source: Size
fr_fr: Taille

source: Popup height, in pixels
fr_fr: Hauteur de la fenêtre contextuelle, en pixels

source: Height
fr_fr: Hauteur

source: Popup width, in pixels
fr_fr: Largeur de fenêtre contextuelle, en pixels

source: Width
fr_fr: Largeur

source: Layout
fr_fr: Mise en page

source: Paths: url & folders
fr_fr: Chemins : URL & dossiers

source: The following options usually do not need further action. Nevertheless, Lumière! can be widely customized to match your needs.
fr_fr: Les réglages ci-dessous ne nécessitent normalement pas d’action supplémentaire. Néanmoins, Lumière! peut être modifiée pour correspondre à vos besoins.

source: Advanced
fr_fr: Avancé

source: Paths & Layout
fr_fr: Chemins & Mise en page

source: vote average
fr_fr: moyenne de votes

source: Crew
fr_fr: Equipe

source: Actors
fr_fr: Acteurs

source: Movie
fr_fr: Film

source: Delete all cache
fr_fr: Effacer tout le cache

source: Delete all cache? Really?
fr_fr: Effacer tout le cache ? Vraiment ?

source: If you want to refresh people's cache regardless the cache expiration time, you may either tick people checkbox(es) related to the person you want to delete and click on "delete cache", or you may click on individual people's "refresh". The first way will require an additional people refresh - from you post, for instance.
fr_fr: Si vous souhaitez rafraîchir le cache des personnes, quel que soit le temps d’expiration du cache, vous pouvoir soit sélectionner les cases à cocher liées à la personne à effacer et cliquer sur « effacer cache », soit sélectionner individuellement le paramètre « rafraîchir » des personnes. Le premier moyen demandera un rafraîchissement supplémentaire – depuis votre article, par exemple.

source: People's detailed cache
fr_fr: Cache spécifique des personnes

source: delete
fr_fr: effacer

source: * from cache?
fr_fr: * du cache ?

source: Delete *
fr_fr: Effacer *

source: refresh
fr_fr: actualiser

source: last updated on
fr_fr: dernière mise à jour le

source: You may also either delete individually the cache or by group.
fr_fr: Vous pouvez également soit effacer individuellement le cache ou le faire par groupe.

source: Movie's detailed cache
fr_fr: Cache spécifique des films

source: for
fr_fr: pour

source: Total cache size:
fr_fr: Taille totale du cache :

source: Update settings
fr_fr: Enregistrer les modifications

source: Reset settings
fr_fr: R&eacute;initialiser

source: (one month)
fr_fr: (un mois)

source: Cache files older than this value (in seconds) will be automatically deleted. Insert "0" or click "never" to keep cache files forever.
fr_fr: Les fichiers de cache plus anciens que cette valeur (en secondes) seront automatiquement effac&eacute;s. Ins&eacute;rer "0" or cliquer sur "jamais" pour garder ind&eacute;finiment les donn&eacute;es de cache.

source: (never)
fr_fr: (jamais)

source: Cache expire
fr_fr: Expiration cache

source: Whether to use a cached page to retrieve the information (if available).
fr_fr: Utiliser des pages de cache pour récupérer les informations (si disponible).

source: Use cache?
fr_fr: Utiliser le cache ?

source: Cache directories
fr_fr: R&eacute;pertoires cache

source: No
fr_fr: Non

source: Yes
fr_fr: Oui

source: Default:
fr_fr: Par défaut :

source: Image cache is empty.
fr_fr: Le cache image est vide.

source: Images cache is using
fr_fr: Le cache image utilise

source: Check folder permissions!
fr_fr: Vérifiez les permissions du dossier !

source: Folder doesn't exist!
fr_fr: Le dossier n’existe pas !

source: Folder exists.
fr_fr: Le répertoire existe.

source: Movies' cache is empty.
fr_fr: Le cache des films est vide.

source: Movies' cache is using
fr_fr: Le cache des films utilise

source: Cache directory (absolute path)
fr_fr: R&eacute;pertoire cache (chemin absolu)

source: Manage Cache
fr_fr: Gérer le cache

source: IMDb's page for this movie
fr_fr: Page IMDb pour ce film

source: Go to IMDb website for this movie
fr_fr: Allez sur le site internet de IMDb pour ce film

source: trivia
fr_fr: anecdote

source: biographical movie
fr_fr: film biographique

source: cause
fr_fr: de

source: Died on
fr_fr: Mort le

source: in
fr_fr: &agrave;

source: Born on
fr_fr: N&eacute; le

source: Misc
fr_fr: Divers

source: Biography
fr_fr: Biographie

source: Results related to
fr_fr: Choix correspondants &agrave;

source: official website
fr_fr: site web officiel

source: Watch on IMBb website the trailer for %1s
fr_fr: Voir la bande annonce sur le site IMDb pour %1s

source: Rating
fr_fr: Notation

source: no picture
fr_fr: pas de photo

source: Tags:
fr_fr: Etiquettes :

source: Filed under:
fr_fr: Catégorisé sous :

source: Open the blog
fr_fr: Ouvrir le blog

source: Taxonomy
fr_fr: Taxonomie

source: Cache options
fr_fr: Options de cache

source: Lumière Menu
fr_fr: Menu Lumière

source: Help
fr_fr: Aide

source: Help page
fr_fr: Page d’aide

source: Cache management options page
fr_fr: Options de la gestion du cache

source: Lumière options page
fr_fr: Page d’option Lumière!

source: help
fr_fr: aide

source: How to use Lumière!, check FAQs & changelog
fr_fr: Comment utiliser Lumière!, consulter les FAQs et le journal des modifications

source: Cache management
fr_fr: Gestion du cache

source: unactivated
fr_fr: désactivé

source: Widget unactivated
fr_fr: Widget désactivé

source: Options reset.
fr_fr: Options réinitialisées.

source: Options saved.
fr_fr: Options sauvegardées.
